[
  {
    "code": " Anatomy \u0026 Physiology for Human Health I",
    "name": "HH/GH 1001 3.00",
    "description": "Examines human anatomy and physiology with a focus on health and disease in the body as a whole as well as each body system. Students examine how the different body systems work together to maintain homeostasis and how the systems react when homeostasis is disrupted by disease. Course credit exclusions: HH/IHST 1001 3.00, HH/KINE 2011 3.00, HH/KINE 2031 3.00, SC/ NATS 1650 6.00 Previously Offered as HH/IHST 1001 3.00"
  },
  {
    "code": " Anatomy \u0026 Physiology for Human Health II",
    "name": "HH/GH 1002 3.00",
    "description": "Examines human anatomy and physiology with a focus on health and disease in the body as a whole as well as each body system. Students examine how the different body systems work together to maintain homeostasis and how the systems react when homeostasis is disrupted by disease. Course credit exclusions: HH/IHST 1002 3.00, HH/KINE 2011 3.00, HH/KINE 2031 3.00, SC/ NATS 1650 6.00. Previously Offered as HH/IHST 1002 3.00"
  },
  {
    "code": " Foundations of Global Health Studies",
    "name": "HH/GH 1010 3.00",
    "description": "An interdisciplinary and multidisciplinary introduction to the issues underlying Canadian and international health care systems. Examines the social, cultural, economic and political influences on concepts, values and structures of Canadian and international health care systems. Course Credit Exclusion: HH/IHST 1010 3.00, HH/HLST 1010 3.00 Previously Offered as HH/IHST 1010 3.00"
  },
  {
    "code": " Global Health Policy: Power and Politics",
    "name": "HH/GH 2000 3.00",
    "description": "Analyzes the process through which global health policy is developed. As national and global initiatives can intertwine, the course begins by exploring and categorizing the manner in which nation governments are structured, and the factors that influence the process of policy decision-making at the national and global levels. Explores case studies that demonstrate global health policy development. Prerequisite: HH/IHST 1010 3.00 or HH/GH 1010 3.00 Course Credit Exclusions: HH/IHST 2000 3.00 Previously Offered as HH/IHST 2000 3.00"
  },
  {
    "code": " Methods and Approaches in Global Health Research",
    "name": "HH/GH 2010 6.00",
    "description": "General Description: An introduction to the research cycle and the judicious use of quantitative and qualitative methodologies in the context of global health. Topics such as asking global health research questions, partnership involvement, capacity building, design, ethical conduct, data collection, analysis, interpretation, writing up, dissemination and uptake of global health research will be covered. Course Credit Exclusions: HH/KINE 2049 3.00 and HH/KINE 2050 3.00 or HH/PSYC 2021 3.00 and HH/PSYC 2030 3.00 or HH/HLST 2300 6.00 or HH/IHST 2010 6.00 Previously Offered as HH/IHST 2010 6.00"
  },
  {
    "code": " Chronic Diseases \u0026 Care",
    "name": "HH/GH 2100 3.00",
    "description": "Examines the complexity and impact of chronic diseases, also known as non-communicable diseases, within national and international health care systems. It will define and investigate the current prevalence, significance, risk factors and determinants of the major current chronic conditions and their prevention and management. Prerequisites: HH/IHST 1000 6.00 or HH/GH 1000 6.00 or HH/IHST 1001 3.00 or HH/GH 1001 3.00 and HH/IHST 1002 3.00 or HH/GH 1002 3.00 Previously Offered as HH/IHST 2100 3.00"
  },
  {
    "code": " Determinants of Health: Local to Global",
    "name": "HH/GH 2200 3.00",
    "description": "Provides an opportunity for participants to develop or strengthen their understanding of social determinants of health from a global perspective. Participants will engage in critical analysis of social inequities and the health consequences to global populations and will also develop an understanding of the concept of global citizenship. Course Credit Exclusion: HH/HLST 3010 3.00, HH/IHST 2200 3.00 Previously Offered as HH/IHST 2200 3.00"
  },
  {
    "code": " Epidemiology and Global Health",
    "name": "HH/GH 3000 3.00",
    "description": "An introduction to the basic principles of epidemiology. The use of epidemiologic methods for population and public health research will be emphasized. Prerequisites: HH/IHST 1000 6.00 or HH/GH 1000 6.00 or HH/IHST 1001 3.00 or HH/GH 1001 3.00 and HH/IHST 1002 3.00 or HH/GH 1002 3.00, HH/IHST 2100 3.00 or HH/GH 2100 3.00, HH/IHST 2010 6.00 or HH/GH 2010 6.00, HH/KINE 2049 3.00 and HH/KINE 2050 3.00, or PSYC 2020 6.00 or HH/PSYC 2021 3.00 and HH/PSYC 2030 or HH/HLST 2300 6.00. Course Credit Exclusions: HH/IHST 3000 3.00 Open to: Students in the BA and BSc in Global Health. Previously Offered as HH/IHST 3000 3.00"
  },
  {
    "code": " Communicable Diseases and Care",
    "name": "HH/GH 3100 3.00",
    "description": "Introduces students to the current theories and knowledge of communicable diseases and programs in place to address the spread of communicable diseases. Prerequisites: HH/IHST 1000 6.00 or HH/GH 1000 6.00 or HH/IHST 1001 3.00 or HH/GH 1001 3.00 and HH/IHST 1002 3.00 or HH/GH 1002 3.00, HH/IHST 2100 3.00 or HH/GH 2100 3.00, HH/IHST 2010 6.00 or HH/GH 2010 6.00 Course Credit Exclusions: HH/IHST 3100 3.00 Open to: Students in the BA and BSc in Global Health. Previously Offered as HH/IHST 3100 3.00"
  },
  {
    "code": " Creating Intercultural Safety",
    "name": "HH/GH 3200 3.00",
    "description": "Global health requires students to understand the core concepts in understanding and navigating \"differences\" as these are socially produced and embedded within power relations. Students critically examine theoretical approaches to cultural safety, cultural competence and anti-oppression to develop an integrative approach to intercultural awareness and safety. Working with a broad definition of culture that explicitly includes an intersectional understanding of culture/diversity students explore the impact of cultural patterns and social locations on self and others. Through reflective assignments, students gain insight into their own cultural positionality and explore how to be an affective ally and advocate to promote equity and health for all. Understanding varied definitions of health and healing and different approaches to communication are fundamental tools for developing effective health care policies, strategies, and care approaches. Prerequisites: HH/GH 1010 3.00 or HH/HLST 1010 3.00 or HH/IHST 1010 3.00 or HH/PSYC 1010 6.0 Cross-listed to: HH/NURS 3200 3.00 Course Credit Exclusions: HH/IHST 3200 3.000 6.00 Note: This course does not count as a science credit for BSc degree programs. Previously Offered as HH/IHST 3200 3.00"
  },
  {
    "code": " Promoting Global Health",
    "name": "HH/GH 3545 3.00",
    "description": "Students examine the evidence that while progress in achieving important global health outcomes has occurred, significant challenges remain to be solved. Global health issues impacted by such factors as poverty, gender inequality, international trade policy, climate-change, loss of biodiversity, food insecurity, war and displacement are explored as expressions of structural influences which perpetuate global disparities in health. Asking the question What would it take to achieve health for all?  students identify pressing global health issues and the global health promotion strategies being used to address them. Prerequisites: HH/IHST 1010 3.00 or HH/GH 1010 3.00, HH/IHST 2000 3.00 or HH/GH 2000 3.00, HH/IHST 2200 3.00 or HH/GH 2200 3.00 Course Credit Exclusions: HH/IHST 3545 3.00 Open to: Students in the BA/BSc Global Health. Previously Offered as HH/IHST 3545 3.00"
  },
  {
    "code": " Global Health Architecture",
    "name": "HH/GH 3550 3.00",
    "description": "Provides a comprehensive overview of the current and constantly changing Global Health Architecture, its evolution since the Second World War and the forces that influence and shape this process. The course will critically assess the global forces that interact, inform, influence and shape global health policies, programs and macro-level resource allocation. Prerequisites: HH/HLST 2020 3.00 or HH/IHST 2000 3.00 or HH/GH 2000 3.00 Course Credit Exclusions: HH/IHST 3550 3.00 Previously Offered as HH/IHST 3550 3.00"
  },
  {
    "code": " Health Care Planning for Communities",
    "name": "HH/GH 3740 3.00",
    "description": "This course provides a theoretical and methodological background for health problem analysis and program/service planning at the community and regional levels. Cross-listed to: HH/NURS 3740 3.00 Course Credit Exclusions: HH/IHST 3740 3.00 Previously Offered as HH/IHST 3740 3.00"
  },
  {
    "code": " Independent Study",
    "name": "HH/GH 4000 3.00",
    "description": "Students may arrange to do independent study with faculty members of the Global Health Program and the Faculty of Health. This course is intended to enable students of exceptional ability to pursue individual fields of interest not otherwise provided for by their regular curriculum. Students must be accepted by a faculty supervisor before they can register in this course and require approval from the Program Director. Prerequisite: Students applying for Independent Study must have (1) completed 72 academic credits including related introductory courses in the topic area, and (2) achieved an overall GPA of 6.0 OR a GPA of 6.0 in the student\u0027s last 30 credits. Open to: Students in the BA/BSc Global Health and other Health majors and/or students whose study proposal is relevant to current health issues Notes: The maximum number of Independent Study Course credits is 18 credits. Students may take a maximum of 12 credits of Independent Study Courses within their last 30 credits of their degree studies and may take a maximum of 12 credits of Independent Study Courses with the same faculty member. Previously Offered as HH/IHST 4000 3.00"
  },
  {
    "code": " Independent Study",
    "name": "HH/GH 4000 6.00",
    "description": "Students may arrange to do independent study with faculty members of the Global Health Program and the Faculty of Health. This course is intended to enable students of exceptional ability to pursue individual fields of interest not otherwise provided for by their regular curriculum. Students must be accepted by a faculty supervisor before they can register in this course and require approval from the Program Director. Prerequisite: Students applying for Independent Study must have (1) completed 72 academic credits including related introductory courses in the topic area, and (2) achieved an overall GPA of 6.0 OR a GPA of 6.0 in the student\u0027s last 30 credits. Open to: Students in the BA/BSc Global Health and other Health majors and/or students whose study proposal is relevant to current health issues Notes: The maximum number of Independent Study Course credits is 18 credits. Students may take a maximum of 12 credits of Independent Study Courses within their last 30 credits of their degree studies and may take a maximum of 12 credits of Independent Study Courses with the same faculty member. Previously Offered as HH/IHST 4000 6.00"
  },
  {
    "code": " Global Health Ethics",
    "name": "HH/GH 4010 3.00",
    "description": "Analyzes the nature and extent of some of the main ethical issues involved in global health practice, policy, and research. Explores the theoretical and practical application of global health\u0027s population-level approach to allow for reflection on the role ethical theory, concepts, and values play in advancing global health\u0027s social mission. Prerequisites: HH/IHST 1010 3.00 or HH/GH 1010 3.00 and HH/IHST 2000 3.0 or HH/GH 2000 3.00 Course Credit Exclusion: HH/HLST 4010 3.00, HH/IHST 4010 3.00 Previously Offered as HH/IHST 4010 3.00 Note: Students can enrol by permission of course instructor"
  },
  {
    "code": " Policy and Program Evaluation in Global Health",
    "name": "HH/GH 4100 3.00",
    "description": "Provides an overview to the field of policy and program evaluation including topics such as challenges for evaluation practice in the global health context, working with stakeholders, traditional and critical approaches to research in evaluation, effective evaluation design including logic models and theories of change, the use of mixed methods and management and communication. Prerequisites: HH/IHST 2010 6.00 or HH/GH 2010 6.00, HH/IHST 2000 3.00 or HH/GH 2000 3.00 Corequisite: HH/IHST 3740 3.00 or HH/GH 3740 3.00. Course Credit Exclusions: HH/IHST 4100 3.00 Previously Offered as HH/IHST 4100 3.00"
  },
  {
    "code": " Global Health Governance and Leadership",
    "name": "HH/GH 4200 3.00",
    "description": "Introduces students to global health governance as a mechanism for resolving transnational interdependent health problems where global cooperation is needed. The course is designed to give students an understanding of issues in global health governance. The course combines theory with application to develop leadership skills needed to work with organizations that provide support for global health initiatives. Prerequisites: HH/IHST 2200 3.00 or HH/GH 2200 3.00, HH/IHST 2000 3.00 or HH/GH 2000 3.00. Corequisite: HH/IHST 4510 3.00 or HH/GH 4510 3.00. Course Credit Exclusions: HH/IHST 4200 3.00 Previously Offered as HH/IHST 4200 3.00"
  },
  {
    "code": " Global Health Practicum",
    "name": "HH/GH 4300 9.00",
    "description": "Designed to bridge theory and practice in a variety of health settings, the Practicum is a 250-hour planned, supervised and evaluated research and practice based experience in which students are mentored and supported by qualified supervisors and faculty. The course also includes seminars and reflective and applied assignments. Prerequisites: completed 21 credits in approved stream electives and all 3000 \u0026 4000 courses in the program except for HH/IHST 4400 3.00 or HH/GH 4400 3.00 Course Credit Exclusions: HH/IHST 4300 9.00 Open to: Specialized Honours Global Health majors. Previously Offered as HH/IHST 4300 9.00"
  },
  {
    "code": " Applied Global Health Research Capstone",
    "name": "HH/GH 4400 3.00",
    "description": "This capstone course will be in topic areas reflecting concentrations in Global Health Specialized Honours, Global e-Health; Global Health policy management and systems; Global Health promotion and disease prevention; and Global Health and the Environment. This course will support synthesis of learning from the practicum and previous courses in the program and develop seminar leadership skills. Prerequisites: All 3000- and 4000-level courses in the major. Corequisite: HH/IHST 4300 9.00 Course Credit Exclusion: HH/IHST 4400 3.00 Previously Offered as HH/IHST 4400 3.00"
  },
  {
    "code": " Global Health and Human Rights",
    "name": "HH/GH 4510 3.00",
    "description": "Provides an introduction to international law, human rights, and the right to health. Explores the relationship between health and human rights, and how human rights provides a form of social machinery to improve well-being and promote social justice. Also explores the benefits and challenges of taking a human rights-based approach in global health through investigating its application in different case studies. Open to: Students who have earned at least 36 credits or received permission of course instructor. Course Credit Exclusion: HH/HLST 4510 3.00"
  },
  {
    "code": " Secondary Prevention of Heart Disease: Cardiac Rehabilitation in a Global Context",
    "name": "HH/GH 4720 3.00",
    "description": "Examines the secondary prevention of cardiovascular disease from a behavioural, psychosocial and health services lens. Major emphasis is placed on cardiac rehabilitation, with regard to delivery, effects on health outcomes, and equitable access. Development of cardiac rehabilitation in low-resource settings, and global efforts in control of non-communicable diseases will also be examined. Corequisite: HH/GH 2100 3.00 or HH/IHST 2100 3.00 or HH/KINE 2049 3.00 or HH/NURS 3515 3.00 Cross-listed to: HH/GH 4720 3.00, HH/NURS 4700 3.00 Course Credit Exclusions: HH/IHST 4720 3.00"
  },
  {
    "code": " Foundations of Health Studies I",
    "name": "HH/HLST 1010 3.00",
    "description": "An inter- and multi-disciplinary introduction to the issues underlying Canada\u0027s health care system. Examines the social, cultural, economic, and political influences on concepts, values and structures of Canada\u0027s health care system. Course credit exclusion: HH/IHST 1010 3.00"
  },
  {
    "code": " Foundations of Health Studies II",
    "name": "HH/HLST 1011 3.00",
    "description": "Uses the entry point of faculty research to explore a wide range of issues and social contexts in health care. Case studies and course material will focus on the struggle for health and equity for all."
  },
  {
    "code": " Mathematics for Health Studies",
    "name": "HH/HLST 1111 3.00",
    "description": "Introduces and encourages mastery of introductory mathematical concepts and quantitative literacy relevant to health policy, management and informatics applications. Open to: BHS students"
  },
  {
    "code": " Social Determinants of Health",
    "name": "HH/HLST 2010 3.00",
    "description": "Societal factors determine why some people stay healthy and others become ill. This course examines how these determinants of health influence health. Focus is upon income, stress, early life, social exclusion, work conditions, unemployment, social support, addiction, food and transportation. Prerequisites: HH/HLST 1010 3.00 and HH/HLST 1011 3.00 Course Credit Exclusions: HH/IHST 2200 3.00 Note: Non-BHS students can contact Course Director for permission to enrol. Previously: HH/HLST 3010 3.00"
  },
  {
    "code": " Health Policy: Power and Politics",
    "name": "HH/HLST 2020 3.00",
    "description": "Examines the development of health policy from the micro, meso and macro points of view. Explores how decisions are made and the role of both government and non-government bodies, using case histories to illustrate the interplay of these factors. Prerequisites: HH/HLST 1010 3.00 and HH/HLST 1011 3.00. Course Credit Exclusion(s): HH/IHST 2000 3.00."
  },
  {
    "code": " Health Management 1: Essentials of Health Care Management",
    "name": "HH/HLST 2030 3.00",
    "description": "Examines key areas that comprise the field of health care management by building on the root disciplines of organizational theory, strategic management and organizational behavior. Topics include the design and managerial roles in health care organizations, leadership and motivation, work team performance and interorganizational relationships. Prerequisite: HH/HLST 1010 3.00 and HH/HLST 1011 3.00 and AP/ADMS 1000 3.00, or HH/IHST 1010 3.00."
  },
  {
    "code": " Health Informatics 1: Introduction to Health Informatics",
    "name": "HH/HLST 2040 3.00",
    "description": "Introduces basic principles of health informatics as applied to a variety of health and social area applications. Examines how the delivery of healthcare is changed in response to new technology development. Explores knowledge and skills in the field of health data collection, storage, process and communication. Prerequisite: HH/HLST 1010 3.00 and HH/HLST 1011 3.00 or HH/IHST 1010 3.00. Course Credit Exclusion(s): HH/HLST 2050 3.00."
  },
  {
    "code": " Statistical Methods in Health Studies",
    "name": "HH/HLST 2300 6.00",
    "description": "An introduction to the analysis of data from health studies. Fundamental concepts and techniques of both descriptive and inferential statistics and their application to health research. Prerequisite: HH/HLST 1010 3.00 and HH/HLST 1011 3.00. Course Credit Exclusion(s): AP/ADMS 2300 6.00 (prior to summer 2018) or HH/KINE 2050 3.00 or HH/PSYC 2020 6.00 or HH/PSYC 2021 3.00 and HH/PSYC 2022 3.00 Note: HH/HLST 1111 3.00 Mathematics for Health Studies highly recommended for students without 12U Math."
  },
  {
    "code": " Pharmaceutical Politics and Policy",
    "name": "HH/HLST 3015 3.00",
    "description": "Examines the place of pharmaceuticals in the Canadian health care system. Focuses on conflicts among stakeholders in policy formation, costs and physician prescribing behaviour. Prerequisite: HH/HLST 2020 3.00. Open to: Students who have 54 earned credits."
  },
  {
    "code": " Major Themes in Health Policy in Canada",
    "name": "HH/HLST 3110 3.00",
    "description": "Examines critical points in the development of Canada\u0027s health care system at the municipal, provincial and federal level. Focuses on understanding the perspective of the different parties and the historical context in which the policies were implemented. Prerequisite: HH/HLST 2020 3.00. Open to: Students who have 54 earned credits."
  },
  {
    "code": " Health Policy II: Analyzing Processes of Power and Politics",
    "name": "HH/HLST 3120 3.00",
    "description": "A continued exploration of the processes of health policy development and the outcomes to which they lead. Varying analytic approaches will be applied to three policy themes: the public/private mix in health care, integrated health systems and international health systems. Prerequisite: HH/HLST 2020 3.00 Open to: Students who have 54 earned credits."
  },
  {
    "code": " Integrated Health Systems in Canada",
    "name": "HH/HLST 3230 3.00",
    "description": "Examines and critiques the elements and concepts of an evolving integrated health system (IHS) in Canada. Studies the evolution and the socio-political-economic impact of this new evolving holistic and integrated health-healing model from an interdisciplinary and cross-sectoral perspective. Prerequisite: HH/HLST 2030 3.0. Open to: Students who have 54 earned credits."
  },
  {
    "code": " Occupational Health and Safety",
    "name": "HH/HLST 3240 3.00",
    "description": "Covers federal and provincial occupational health and safety legislation, hazard identification and control, physical agents, chemical agents, socio-psychological aspects of health and the management of safety programs. Prerequisite: None"
  },
  {
    "code": " Health Services Accounting",
    "name": "HH/HLST 3260 3.00",
    "description": "Examines accounting practices in various health sectors and organizations in Canada. Prerequisite: HH/HLST 2030 3.00. Course Credit Exclusions: HLST 3250 6.00, AP/ADMS 3525 3.00. Open to: Students who have 54 earned credits."
  },
  {
    "code": " Health Services Finance",
    "name": "HH/HLST 3265 3.00",
    "description": "Examines finance practices in various health sectors and organizations in Canada. Prerequisite: HH/HLST 3260 3.00. Course Credit Exclusions: HH/HLST 3250 6.00, AP/ADMS 3526 3.00. Open to: Students who have 54 earned credits."
  },
  {
    "code": " Electronic Health Record",
    "name": "HH/HLST 3310 3.00",
    "description": "Provides students with the knowledge and skills to manage health information services in health organizations, to use computer technologies to collect, manage analyze and technically evaluate health information and work with confidential health records. Prerequisites: HH/HLST 2040 3.00 or HH/HLST 2050 3.00. Open to: Students who have 54 earned credits."
  },
  {
    "code": " Health Database Applications",
    "name": "HH/HLST 3320 3.00",
    "description": "Students will develop a working knowledge of design, implementation, administration and maintenance of relational database systems used in various areas in healthcare. Oracle, the full-scale multi-platform database management system, is used to teach database design and client/server application development and implementation. Prerequisites: HH/HLST 2040 3.00 or HH/HLST 2050 3.00. Open to: Students who have 54 earned credits."
  },
  {
    "code": " Global eHealth/Virtual Communities",
    "name": "HH/HLST 3330 3.00",
    "description": "The course provides student with knowledge of Virtual Communities and their applications in e-Health, at a global level. It investigates the Virtual Community paradigm, its relation to the computer supported collaborative work, the internet and smart devices. The course also studies the convergence of Virtual Communities with social media, and their applications in global e-Health initiatives in different areas, such as homecare, chronic disease management, telemonitoring, and patient support. Prerequisite: HH/HLST 2040 3.00 or HH/HLST 2050 3.0. Open to: Students who have 54 earned credits."
  },
  {
    "code": " Health Informatics II: Health Information Systems",
    "name": "HH/HLST 3341 3.00",
    "description": "Designed to develop a global understanding of the significance of health information systems (HIS) in healthcare. Topics include: health information management, HIS implications in transformation of health care and health care services delivery, standards development, technical and policy issues surrounding security, privacy and confidentiality of health care data. Prerequisite: HH/HLST 2040 3.00 or HH/HLST 2050 3.00. Open to: Students who have 54 earned credits."
  },
  {
    "code": " Health Data Analytics, Machine Learning and AI",
    "name": "HH/HLST 3350 3.00",
    "description": "Provides a practical introduction to Health Data analytics to students from multiple disciplines. It permits students to understand data analytics including descriptive, predictive and prescriptive analytics, machine learning, artificial intelligence and the different tools that can be deployed to implement health data analytics. Students would be able to understand how and when healthcare analytics can be used to make better decisions; they will also be able to identify the opportunities and the challenges that analytics present to health and society. Prerequisite: HH/HLST 2300 6.00"
  },
  {
    "code": " Healthcare Quality Improvement and Patient Safety",
    "name": "HH/HLST 3400 3.00",
    "description": "Analyzes issues related to health system improvement and patient safety. Examines quality improvement and patient safety theory and techniques and considers the barriers and facilitating factors for bringing about improvement in the delivery and outcomes of health care faced by managers, clinicians and organizations. Prerequisite: HH/HLST 2030 3.00. Open to: Students who have 54 earned credits."
  },
  {
    "code": " Aging: Comparative Perspectives",
    "name": "HH/HLST 3520 3.00",
    "description": "This course will explore various approaches to understanding contemporary aging issues. Open to: Students who have 54 earned credits."
  },
  {
    "code": " Population Aging and Health: Policies, Programs and Issues",
    "name": "HH/HLST 3530 3.00",
    "description": "Aging in Canada has been depicted by many in the health care community as a looming calamity. Takes a unique Canadian focus and proposes that population aging can be a challenge that will force Canada\u0027s health care system to make some careful and innovative policy, program and service choices. Open to: Students who have 54 earned credits."
  },
  {
    "code": " Health Care Law",
    "name": "HH/HLST 4000 3.00",
    "description": "Legislation relevant to health care; consent to treatment; cases of negligence; medical staff privileges; release of information. Prerequisites: HH/HLST 2020 3.00, HH/HLST 2030 3.00 and HH/HLST 2040 3.00. Open to: Students in the BHS Honours program with 84 earned credits."
  },
  {
    "code": " Health Care Ethics: Policy and Management Perspectives",
    "name": "HH/HLST 4010 3.00",
    "description": "Provides an overview of ethical issues involved in health care policy, management and informatics in Canada. It combines theory and practical application to allow for reflection on the role values and beliefs play in health policy, management and informatics decisions. Prerequisites: HH/HLST 2020 3.00, HH/HLST 2030 3.00 and HH/HLST 2040 3.00. Course Credit Exclusion: HH/IHST 4010 3.00 Open to: Students in the BHS Honours program with 84 earned credits."
  },
  {
    "code": " Comparative Health Policy",
    "name": "HH/HLST 4110 3.00",
    "description": "Examines historical, cultural, environmental, economic and political considerations of national health systems throughout the world, especially as health becomes less isolated and more an interconnected and integral part of all the other systems impacting our globe. Prerequisites: HH/HLST 2020 3.00 or HH/IHST 2000 3.00. Open to: Students in the BHS Honours program with 84 earned credits."
  },
  {
    "code": " Applied Research Approaches in Health Studies: Advanced Seminar",
    "name": "HH/HLST 4200 6.00",
    "description": "Examines key issues associated with inquiry into health policy, management and informatics issues. The advanced seminar topics include various research methods and design issues relevant to health studies, data analysis and communication of research findings. Prerequisites: HH/HLST 2020 3.00, HH/HLST 2030 3.00, HH/HLST 2040 3.00 and HH/HLST 2300 6.00. Note: Students with course equivalents to HH/HLST 2300 6.00 will be required to complete Lynda.com SPSS training, or equivalent, before enrolling and submitting proof of completion to the School. Open to: Students in the BHS Honours program with 84 earned credits."
  },
  {
    "code": " Health Care Leadership",
    "name": "HH/HLST 4210 3.00",
    "description": "Addresses the most salient leadership skills required for the micro-meso-macro developments in the health care field in Canada: foresight, systems thinking, issue management, impact assessment, critical thinking, contingency planning, visioning, strategic planning, change management, facilitation and negotiation. Prerequisite: HH/HLST 2030 3.00. Open to: Students in the BHS Honours program with 84 earned credits."
  },
  {
    "code": " Measuring Health System Performance/Effectiveness",
    "name": "HH/HLST 4250 3.00",
    "description": "Analyzes issues related to the measurement, dissemination and use of health system performance information. Examines the measurement of health system performance at multiple levels in the system and in different settings and jurisdictions. Prerequisite: HH/HLST 2030 3.00. Open to: Students in the BHS Honours program with 84 earned credits."
  },
  {
    "code": " Analysis and Design of Health Information Systems",
    "name": "HH/HLST 4310 3.00",
    "description": "Provides the students with the knowledge and the ability to analyze health information systems and design health systems specifications to meet specific objectives, using the appropriate CASE tools. Methods for structured health analysis and design are covered. The use of teamwork is emphasized. Prerequisites: HH/HLST 3320 3.00. Open to: Students in the BHS Honours program with 84 earned credits."
  },
  {
    "code": " eHealth",
    "name": "HH/HLST 4320 3.00",
    "description": "Introduces the major issues and trends in the application of Information and Communication Technologies (ICT) in the health care service sector. Open to: Students in the BHS Honours program with 84 earned credits."
  },
  {
    "code": " Decision Making and Decision Support Systems in Healthcare",
    "name": "HH/HLST 4330 3.00",
    "description": "Integrates literature on decision making and literature on management information systems in the health care context to illuminate the rational and non-rational aspects of decision making in health care. Prerequisite: HH/HLST 2300 6.00 Open to: Students in the BHS Honours program with 84 earned credits"
  },
  {
    "code": " Health and Human Rights",
    "name": "HH/HLST 4510 3.00",
    "description": "Examines how health and human rights are complementary approaches to understanding and analyzing human well-being. The congruence of the two fields has arisen as the definition of human rights has expanded from civil and political rights to include social and economic rights. Will examine this evolution and its implications. Course credit exclusion: HH/IHST 4510 3.00 Open to: Students in the BHS Honours program with 84 earned credits"
  },
  {
    "code": " Health Sector Applied Project",
    "name": "HH/HLST 4900 6.00",
    "description": "Provides qualified students with career relevant learning experiences and the opportunity to bridge theory and practice by undertaking a team project under the direction of the course director(s) in collaboration with a community partner in a healthcare or health-related organization. Students will apply project management concepts in an interdisciplinary team of students from within the SHPM and or across the university. Prerequisite(s): HH/HLST 2020 3.00, HH/HLST 2030 3.00, HH/HLST 2040 3.00, HH/HLST 2300 6.00, and HH/HLST2010 3.00 or HH/HLST 3010 3.00 Pre/Corequisite: HH/HLST 4200 6.00 Open to: Students in the BHS Honours program with 84 earned credits. Note 1: A minimum GPA of 6.50 is required in major credits. Note 2: Enrollment by permission only. Students complete Seeking Course Permission Form available on School\u0027s website, and the Course Director(s) will select from those who apply. Decisions are made before the start of term."
  },
  {
    "code": " Health Policy, Management, Informatics Practicum",
    "name": "HH/HLST 4990 9.00",
    "description": "Designed to bridge theory and practice in a variety of health care settings, the practicum is a planned, supervised and evaluated practice-based experience in which students are mentored and supported by fieldwork-supervisors. To support students\u0027 development of professionalism skills within work integrated learning, students are required to attend pre-practicum workshops and in-class pre-placement sessions. The practicum course will require 15-20 in-class hours and 250-300 in-field hours. Students will prepare a learning contract, complete a field-based project deliverable, participate in continuous reflective-related exercises and prepare a final practicum poster presentation. The practicum is open to students in BHS specialized honours program. Prerequisites: HH/HLST 4000 3.00, and HH/HLST 4010 3.00 Pre/Corequisites: HH/HLST 4200 6.00 Open to: Students in the BHS Specialized Honours program with 84 earned credits Note 1: A minimum GPA of 7.0 is required in major credits. Note 2: Enrollment is by permission only. Students with the required earned credits are invited to an Information Session in the Winter term prior to placement. Students submit an application, are interviewed and those selected are notified of acceptance by end of Winter term. Note 3: Students are required to complete all pre-practicum risk management and screening requirements before the Winter term of practicum. Note 4: Students are required to attend all in-class pre-practicum sessions and post-practicum sessions and commit to a minimum of 3 days a week in fieldwork placements based on negotiated workdays with the field supervisor, completing a minimum of 250-300 in-field work hours."
  },
  {
    "code": " Agents of Change in a Global World",
    "name": "HH/IHST 1020 6.00",
    "description": "In this foundational course students examine the concepts of health and global health through multiple philosophical and disciplinary lenses. Applying complexity theory, students analyze effective change processes and the attributes of those who lead them. Students reflect on the question \"Can one person make a difference?\" as they construct a scholarly portrait of themselves as agents of change for health. Note 1: Students will engage in experiential learning. This course uses blended learning approaches with alternating on-line and face-to-face learning. Note 2: This course has been approved in the Faculty of Health for general education credits."
  },
  {
    "code": " Sociocultural Perspectives in Kinesiology",
    "name": "HH/KINE 1000 6.00",
    "description": "Introduction to the concept of the \u0027social body\u0027 through study of Western historical legacies and sociological factors of class, gender, \u0027race\u0027, culture with emphasis on sport sociology. Critical reading and research essay skills."
  },
  {
    "code": " Fitness and Health",
    "name": "HH/KINE 1020 6.00",
    "description": "An examination of the components and principles of fitness and health with particular attention to the evaluation and modification of fitness and health status."
  },
  {
    "code": " Applied Human Anatomy and Physiology for Health Professionals I",
    "name": "HH/KINE 1101 3.00",
    "description": "Introduces the learner to the foundations of anatomy and physiology, within the context of the health practitioner. This course takes a systemic approach to learning human anatomy and physiology and content includes an overview of the structure, function, and organization of the human body from the cellular level to organ systems, and explores each major organ system, with a focus on maintaining homeostasis and clinical applications. Part I focuses on cellular organization, genetics, embryology, tissues, the skeletal system, the muscular system and the nervous system. Not open to: Kinesiology majors or Global Health majors Note: This will be a core course for students in the 4-Year Direct Entry BScN nursing degree program so the majority of spaces will be reserved for those students."
  },
  {
    "code": " Applied Human Anatomy and Physiology for Health Professionals II",
    "name": "HH/KINE 1102 3.00",
    "description": "Introduces the learner to the foundations of anatomy and physiology, within the context of the health practitioner. This course takes a systemic approach to learning human anatomy and physiology and content includes an overview of the structure, function, and organization of the human body from the cellular level to organ systems, and explores each major organ system, with a focus on maintaining homeostasis and clinical applications. Part II focuses on the cardiovascular, respiratory, digestive, renal, reproductive, endocrine and immune systems. Course Credit Exclusions: HH/IHST 1002 3.00, HH/KINE 2031 3.00, HH/KINE 2011 3.00, HH/NATS 1650 6.00 Not open to: Kinesiology major students; Global Health major students Note: This will be a core course for students in the 4-Year Direct Entry BScN nursing degree program so the majority of spaces will be reserved for those students."
  },
  {
    "code": " Human Physiology I",
    "name": "HH/KINE 2011 3.00",
    "description": "A cellular basis of physiology from the sub-cellular to cellular components to organs including the functions and the mechanisms of function. The course covers fundamental cell science, cell physiology, plasma membrane potentials, muscle physiology, neuron pathways, blood and components, and basic immunology. Course credit exclusions: HH/IHST 1000 6.00, HH/IHST 1001 3.00, HH/IHST 1002 3.00."
  },
  {
    "code": " Human Anatomy",
    "name": "HH/KINE 2031 3.00",
    "description": "An overview of the gross anatomy of the human body. The following systems are examined: skeletal, muscular, nervous, circulatory, lymphatic, respiratory, digestive, urinary, reproductive and endocrine. Course credit exclusions: HH/IHST 1000 6.00, HH/IHST 1002 3.00, SC/NATS 1650 6.00."
  },
  {
    "code": " Communities in Motion: Exploring the Behavioural and Socio-Cultural Study of Sport and Physical Activity",
    "name": "HH/KINE 2040 3.00",
    "description": "Introduces students to the behavioural and socio-cultural study of sport and physical activity with emphasis on exploring sport and physical activity, including barriers and catalysts, in relation to communities and community building. In addition, this course introduces students to the research processes that underpin the behavioural and socio-cultural study of sport and physical activity - from the starting point of cultivating curiosity, to conceptualizing a research question and project, to the communicating findings with and to others. Open to: Faculty of Health students with 0 to 53 credits."
  },
  {
    "code": " Research Methods in Kinesiology",
    "name": "HH/KINE 2049 3.00",
    "description": "Introduces students to the procedures utilized to design and conduct research in the discipline of kinesiology. Course credit exclusion: HH/PSYC 2030 3.00."
  },
  {
    "code": " Analysis of Data in Kinesiology I",
    "name": "HH/KINE 2050 3.00",
    "description": "An introduction to scientific method and the statistical analysis of experimental data. The conduct of simple experiments, techniques of naturalistic observation and the analysis of resulting data using fundamental concepts of descriptive and inferential statistics. Prerequisite: HH/KINE 2049 3.00. Course credit exclusions: SC/BIOL 2060 3.00, ES/ENVS 2010 6.00, ES/ENVS 2010 3.00, SC/MATH 1132 3.00, SC/MATH 2500 3.00, SC/MATH 2560 3.00, SC/MATH 2565 3.00, HH/PSYC 2020 6.00, HH/PSYC 2021 3.00."
  },
  {
    "code": " Introduction to Sport Administration",
    "name": "HH/KINE 2380 3.00",
    "description": "This course is designed to introduce students to the knowledge and skills needed to be successful in sport management. Topics include leadership styles, communication and change management skills, creative problem-solving and an introduction to event management and marketing. Note: This course does not count for science credit."
  },
  {
    "code": " Coaching: The Art and Science",
    "name": "HH/KINE 2475 3.00",
    "description": "Introduces the fundamental principles involved in the coaching process. Background and philosophic issues related to the coach and the athlete are explored. Note: Upon successful completion of this course, students receive the certification Coaching: Introduction to Competition Part A and Part B of the National Coaching Certification Program."
  },
  {
    "code": " Introduction to Sport Related Injuries",
    "name": "HH/KINE 2495 3.00",
    "description": "Provides students with a broad spectrum of knowledge relating to topics in sport related injuries. Discussions of sport injuries and conditions relating to injury prevention, evaluation and management helps students develop the foundational knowledge relating to the health care field. Corequisite: HH/KINE 2031 3.00. Course Credit Exclusion: HH/KINE 2490 3.00 and HH/KINE 3600 3.00 (prior to fall/winter 2017-18) Open to: Kinesiology and Health Science Students"
  },
  {
    "code": " Athletic Therapy Field Inquiry-Based Tutorial",
    "name": "HH/KINE 2500 3.00",
    "description": "Provides students with knowledge relating to sport, anatomy, biomechanics, epidemiology, pathophysiology, evaluation, management and communication. Classroom focused experiential education through small group discussions of urgent and non-urgent field case studies will be utilized to promote learning, research and critical thinking in five domains including prevention, assessment, intervention, practice management and professional responsibility. Prerequisites: HH/KINE 2031 3.00 HH/KINE 2495 3.00 Corequisites: HH/KINE 2501 3.00 Open to: Athletic Therapy Certificate Program Students within Kinesiology and Health Science"
  },
  {
    "code": " Athletic Therapy Field Seminar and Skills",
    "name": "HH/KINE 2501 3.00",
    "description": "Provides students with knowledge relating to professional practice issues and management within Athletic Therapy. Topics will relate to the foundational principles and concepts of the field care aspect in Athletic Therapy. The course includes classroom focused experiential education through practical lab sessions, guest speakers and case studies. The course provides students with the required psychomotor and communication skills relating to the urgent and nonurgent field case studies discussed in the Athletic Therapy Field Inquiry-Based Tutorial. Skills will include (but are not limited to) the application and management of sport equipment, taping/support techniques, immediate on-field management of major and minor injuries, and sideline assessment. Lab-based activities such as role-playing, mini-case study analysis, simulations and reflection will be integrated. Prerequisites: HH/KINE 2031 3.00 HH/KINE 2495 3.00 Corequisites: HH/KINE 2500 3.00 Open to: Athletic Therapy Certificate Program Students within Kinesiology and Health Science"
  },
  {
    "code": " Athletic Therapy Extremities Inquiry-Based Tutorial",
    "name": "HH/KINE 2502 3.00",
    "description": "Provides students with knowledge relating to sport, anatomy, biomechanics, epidemiology, pathophysiology, evaluation, management and communication. Classroom focused experiential education through small group discussions of extremity related clinical case studies will be utilized to promote learning, research and critical thinking in five domains including prevention, assessment, intervention, practice management and professional responsibility. Prerequisites: HH/KINE2500 3.00, HH/KINE2501 3.00 Corequisites: HH/KINE2503 3.00 Open to: Athletic Therapy Certificate Program Students within Kinesiology and Health Science"
  },
  {
    "code": " Athletic Therapy Extremities Seminar and Skills",
    "name": "HH/KINE 2503 3.00",
    "description": "Provides students with knowledge relating to professional practice issues and management within Athletic Therapy. Topics will relate to the principles and concepts of the clinical extremities care aspect in Athletic Therapy. The course includes classroom focused experiential education through practical lab sessions, guest speakers and case studies. The course provides students with the required psychomotor and communication skills relating to extremity related case studies discussed in the Athletic Therapy Extremity Inquiry-Based Tutorial. Skills will include (but are not limited to) functional/surface anatomy, taping/support techniques, clinical orthopaedic evaluation and tests, electrotherapeutic modality application, manual therapies, and therapeutic exercise. Lab-based activities such as role-playing, mini-case study analysis, simulations and reflection will be integrated. Prerequisites: HH/KINE2500 3.00, HH/KINE2501 3.00 Corequisites: HH/KINE 2502 3.00 Open to: Athletic Therapy Certificate Program Students within Kinesiology and Health Science"
  },
  {
    "code": " Psychology of Physical Activity and Health",
    "name": "HH/KINE 3000 3.00",
    "description": "An overview of the theoretical frameworks and psychological principles related to physical activity, exercise and sport. Prerequisites: HH/KINE 1000 6.00; HH/KINE 1020 6.00; HH/KINE 2049 3.00; HH/KINE 2050 3.00; HH/PSYC 1010 6.00."
  },
  {
    "code": " Human Physiology II",
    "name": "HH/KINE 3012 3.00",
    "description": "The principles of homeostasis and physiological regulation are studied in relation to the cardiorespiratory, renal, locomotor, reproductive and digestive systems. Prerequisite: HH/KINE 2011 3.00. Introductory biology or life science is highly recommended."
  },
  {
    "code": " Skilled Performance and Motor Learning",
    "name": "HH/KINE 3020 3.00",
    "description": "An introduction to the analysis and development of skilled performance. Prerequisites: HH/KINE 2050 3.00; HH/PSYC 2021 3.00 or SC/BIOL 2060 3.00; HH/PSYC 1010 6.00"
  },
  {
    "code": " Biomechanics of Human Movement",
    "name": "HH/KINE 3030 3.00",
    "description": "Human movement is investigated with particular reference to the laws of physics (mechanics) and anatomical concepts as applied to joint motion and muscular action. Application of biomechanics to sports skills execution and laboratory exposure to contemporary analysis are included. Prerequisite: HH/KINE 2031 3.00."
  },
  {
    "code": " Health Psychology and Kinesiology",
    "name": "HH/KINE 3100 3.00",
    "description": "Provides an overview of primary topics in health psychology, emphasizing both psychological research approaches specific to physical activity and its application to behaviours related to eating and weight, pain, cancer and related diseases. Prerequisite: HH/PSYC 1010 6.00. Course credit exclusion: HH/PSYC 3170 3.00."
  },
  {
    "code": " Analysis of Data in Kinesiology II",
    "name": "HH/KINE 3150 3.00",
    "description": "This intermediate course in inferential statistics includes t-tests, multiple regression, ANOVA and selected non-parametric statistics. Practical applications to research in kinesiology and health science are emphasized. Prerequisite: HH/KINE 2050 3.00. Course credit exclusions: SC/BIOL 2060 3.00, ES/ENVS 2010 6.00, SC/MATH 2500 3.00, SC/MATH 2570 3.00, HH/PSYC 2020 6.00, HH/PSYC 2022 3.00."
  },
  {
    "code": " Behavioural Approach to Administration of Fitness and Sport",
    "name": "HH/KINE 3240 3.00",
    "description": "The focus of this course is on working with people. Students learn the theory and practice of team building, communication and counselling skills. Note: This course does not count for science credit."
  },
  {
    "code": " Growth, Maturation and Physical Activity",
    "name": "HH/KINE 3340 3.00",
    "description": "Examines and discuss the literature and research studies in those aspects of physical growth and development that directly concern educators. Individual differences in growth and development are stressed throughout."
  },
  {
    "code": " Adapted Physical Activity",
    "name": "HH/KINE 3345 3.00",
    "description": "Addresses topics related to working with differently abled individuals in a physical activity setting. Theoretical and applied aspects of working with differently abled populations are introduced. Assessment, instruction and evaluation are addressed. Adaptations and modifications are taught for diverse settings including school, recreation and sport. Prerequisites: HH/KINE 1000 6.00 and HH/KINE 2031 3.00."
  },
  {
    "code": " Physiology of Aging",
    "name": "HH/KINE 3349 3.00",
    "description": "Describes the physiology of normal aging. This includes the aging of: cells, organs, bones and joints, muscle and fat, skin, circadian rhythm, nervous system and brain, cardiorespiratory system, and the gastrointestinal and renal systems. The course will introduce some pathophysiology often seen with aging but will highlight that aging does not necessitate development of disease. Prerequisite: HH/KINE 3012 3.00"
  },
  {
    "code": " Physical Activity, Health and Aging",
    "name": "HH/KINE 3350 3.00",
    "description": "Examines the aging process, lifestyle changes and the effect of physical activity on the health of aging adults. Prerequisites: HH/KINE 1020 6.00; HH/KINE 2020 3.00. Note: Internet use is required for this course."
  },
  {
    "code": " Gender and Sexuality in Sport and Health",
    "name": "HH/KINE 3360 3.00",
    "description": "Introduces students to the social production of gender (including femininity and masculinity) and sexuality and how it impacts the worlds of sport and health. The course introduces students to feminist and queer theory approaches within the discipline. Prerequisite: HH/KINE 1000 6.00. Course credit exclusions: HH/KINE 4350 3.00; HH/KINE 4360 3.00. Note: This course does not count for science credit."
  },
  {
    "code": " Fitness Consulting and Personal Fitness Training",
    "name": "HH/KINE 3400 3.00",
    "description": "Provides detailed theoretical and practical instruction on physical activity/exercise prescription, management, supervision and intervention strategies with a focus on health-related fitness outcomes. Prerequisites: HH/KINE 1020 6.00; HH/KINE 2031 3.00; Corequisite: HH/KINE 3012 3.00; HH/KINE 3030 3.00."
  },
  {
    "code": " Canadian Culture and Physical Activity",
    "name": "HH/KINE 3430 3.00",
    "description": "This course examines how Canadian physical activity and health has been organized since Confederation and the processes by which people have fashioned sport and health within economic, social, and political struggles and changes. The course focuses upon the history of Canadian sports, physical education, physical fitness and recreation. Three lecture hours per week. One term. Course credit exclusions: AS/PHED 3430 3.00 (prior to Fall/Winter 1996-1997). Note: This course does not count for science credit."
  },
  {
    "code": " Olympic Games: Heroes and Villains at Play",
    "name": "HH/KINE 3440 3.00",
    "description": "A comparative analysis of recent developments and characteristics of physical education and sports in representative nations and world regions. The course covers objectives, methods, personnel and facilities in physical education and evaluation of selected national sports programs. Note: This course does not count for science credit."
  },
  {
    "code": " Regional Human Anatomy I",
    "name": "HH/KINE 3460 3.00",
    "description": "A comprehensive study of the structures of the human body. This course includes an examination of the upper limb, lower limb and back. Prerequisite: HH/KINE 2031 3.00."
  },
  {
    "code": " Regional Human Anatomy II",
    "name": "HH/KINE 3465 3.00",
    "description": "Examines, in detail, the anatomical regions of the head, neck, back and thorax. Prerequisite: HH/KINE 2031 3.00."
  },
  {
    "code": " Athletic Therapy Head, Trunk \u0026 Spine Inquiry-Based Tutorial",
    "name": "HH/KINE 3500 3.00",
    "description": "Provides students with knowledge relating to sport, anatomy, biomechanics, epidemiology, pathophysiology, evaluation, management and communication. Classroom focused experiential education through small group discussions of head, trunk and spine related clinical case studies will be utilized to promote learning, research and critical thinking in five domains including prevention, assessment, intervention, practice management and professional responsibility. Prerequisites: HH/KINE 2502 3.00, HH/KINE 2503 3.00 Corequisites: HH/KINE 3501 3.00 Open to: Athletic Therapy Certificate Program Students within Kinesiology and Health Science"
  },
  {
    "code": " Athletic Therapy Head Trunk and Spine Seminar and Skills",
    "name": "HH/KINE 3501 3.00",
    "description": "Provides students with knowledge relating to professional practice issues and management within Athletic Therapy. Topics will relate to the concepts of the head, trunk and spine care aspect in Athletic Therapy. The course includes classroom focused experiential education through practical lab sessions, guest speakers and case studies. The course provides students with the required psychomotor and communication skills relating to head, trunk and spine related case studies discussed in the Athletic Therapy Head, Trunk and Spine Inquiry-Based Tutorial. Skills will include (but are not limited to) functional/surface anatomy, taping/support techniques, clinical orthopaedic evaluation and tests, electrotherapeutic modality application, manual therapies, and therapeutic exercise. Lab-based activities such as role-playing, mini-case study analysis, simulations and reflection will be integrated. Prerequisites: HH/KINE 2502 3.00, HH/KINE 2503 3.00 Corequisites: HH/KINE 3500 3.00 Open to: Athletic Therapy Certificate Program Students within Kinesiology and Health Science"
  },
  {
    "code": " Athletic Therapy Upper \u0026 Lower Quadrant Inquiry-Based Tutorial",
    "name": "HH/KINE 3502 3.00",
    "description": "Provides students with knowledge relating to sport, anatomy, biomechanics, epidemiology, pathophysiology, evaluation, management and communication. Classroom focused experiential education through small group discussions of upper and lower quadrant related clinical case studies will be utilized to promote learning, research and critical thinking in five domains including prevention, assessment, intervention, practice management and professional responsibility. Prerequisites: HH/KINE 3500 3.00, HH/KINE 3501 3.00 Corequisites: HH/KINE 3503 3.00 Open to: Athletic Therapy Certificate Program Students within Kinesiology and Health Science"
  },
  {
    "code": " Athletic Therapy Upper \u0026 Lower Quadrant Seminar and Skills",
    "name": "HH/KINE 3503 3.00",
    "description": "Provides students with knowledge relating to professional practice issues and management within Athletic Therapy. Topics will relate to the concepts of the upper \u0026 lower quadrant care aspect in Athletic Therapy. The course includes classroom focused experiential education through practical lab sessions, guest speakers and case studies. The course provides students with the required psychomotor and communication skills relating to upper \u0026 lower quadrant related case studies discussed in the Athletic Therapy Upper \u0026 Lower Quadrant Inquiry-Based Tutorial. Skills will include (but are not limited to) functional/surface anatomy, taping/support techniques, clinical orthopaedic evaluation and tests, electrotherapeutic modality application, manual therapies, and therapeutic exercise. Lab-based activities such as role-playing, mini-case study analysis, simulations and reflection will be integrated. Prerequisites: HH/KINE3500 3.00, HH/KINE3501 3.00 Corequisites: HH/KINE3502 3.00 Open to: Athletic Therapy Certificate Program Students within Kinesiology and Health Science"
  },
  {
    "code": " Athletic Injuries - Extremities",
    "name": "HH/KINE 3575 3.00",
    "description": "This course is an introduction to athletic injuries including injury classification, basic level assessment of the extremities, tissue healing, protective equipment, basic treatment, and common injuries to the extremities. Prerequisite or corequisite: HH/KINE 2031 3.00. PRIOR TO WINTER 2013: course credit exclusions: HH/KINE 3450 3.00."
  },
  {
    "code": " Sociology of Sport I",
    "name": "HH/KINE 3620 3.00",
    "description": "Sociological analysis of sport in contemporary society with particular emphasis on issues relating to children, gender and the Canadian scene. Course credit exclusions: AP/SOCI 3670 3.00. Note: This course does not count for science credit."
  },
  {
    "code": " Fundamentals of Epidemiology",
    "name": "HH/KINE 3635 3.00",
    "description": "Provides an introduction to the basic principles of Epidemiology with emphasis on studies undertaken in the field of kinesiology. Topics include: understanding of different study designs, analytic methods used, validity, outbreak investigation, diagnostic tests and causation. Prerequisite: HH/KINE 2050 3.00."
  },
  {
    "code": " Functional Neuroanatomy",
    "name": "HH/KINE 3650 3.00",
    "description": "Investigates the anatomy of the central nervous system, additionally discussing the clinical functional relevance of each area. Prerequisite: HH/KINE 2031 3.00 or SC/BIOL 4370 3.00 or HH/PSYC 3250 3.00."
  },
  {
    "code": " Molecular and Cellular Neuroscience with Applications to Health",
    "name": "HH/KINE 3670 3.00",
    "description": "The course covers the basic principles of molecular and cellular neuroscience. The course introduces students to the most basic fundamentals of neuroscience, which is the study of the functional properties of the nervous system and relationship between brain and disease. Topics covered range from neuronal structure and function, communication at the synapse and neuromuscular junction, membrane receptors, synaptic transmission, neurotransmitters to the intra- and intercellular signaling systems within the sensory, motor and memory systems. This course provides the background for higher-level courses that deal with more specialized topics in neuroscience and the neurobiology of disease. Prerequisite: HH/KINE 3012 3.00 or HH/NRSC 2000 3.00 or SC/NRSC 2000 3.00 or HH/NRSC 3000 3.00 or SC NRSC 3000 3.00"
  },
  {
    "code": " Immune System in Health and Disease",
    "name": "HH/KINE 3710 3.00",
    "description": "The immune system in health and disease is designed to provide students with an overview of the immune system including innate and adaptive immunity. The emphasis is on normal immune function and on human diseases with immune origin or immune components particularly diseases where motion is limited by disease such as the arthritises. Prerequisite: HH/KINE 2011 3.00; HH/KINE 3012 3.00. Note: May not be taken for credit by Biology or Biochemistry majors."
  },
  {
    "code": " Exercise Physiology",
    "name": "HH/KINE 4010 3.00",
    "description": "The study of the physiological mechanisms involved during physical activity. The course covers the physiological effects of exercise and training upon the neuromuscular, cardiovascular, respiratory and metabolic systems. Prerequisite: HH/KINE 3012 3.00."
  },
  {
    "code": " Human Nutrition",
    "name": "HH/KINE 4020 3.00",
    "description": "Basic energy and regulatory nutrients are examined, followed by an applied nutrition section in weight control, eating disorders, sport nutrition, food as drugs and food safety. Metabolic interrelationships and health associations are applied throughout. Prerequisite: HH/KINE 4010 3.00."
  },
  {
    "code": " Independent Studies in Kinesiology and Health Science",
    "name": "HH/KINE 4060A 6.00",
    "description": "Students undertake a research project under the supervision of a faculty member. This should include a library investigation, and may include laboratory and/or field investigations. A substantial paper, a poster presentation and an oral presentation are part of the course requirements. Prerequisite: Normally only available to students after completion of 84 credits. Note: Some independent study topics may not be eligible for science credit. Students should consult the School of Kinesiology and Health Science for application."
  },
  {
    "code": " Independent Studies in Kinesiology and Health Science",
    "name": "HH/KINE 4060 3.00",
    "description": "Students undertake a research project under the supervision of a faculty member. This should include a library investigation, and may include laboratory and/or field investigations. A substantial paper, a poster presentation and an oral presentation are part of the course requirements. Prerequisite: Normally only available to students after completion of 84 credits. Note: Some independent study topics may not be eligible for science credit. Students should consult the School of Kinesiology and Health Science for application."
  },
  {
    "code": " Independent Studies in Kinesiology and Health Science",
    "name": "HH/KINE 4060 6.00",
    "description": "Students undertake a research project under the supervision of a faculty member. This should include a library investigation, and may include laboratory and/or field investigations. A substantial paper, a poster presentation and an oral presentation are part of the course requirements. Prerequisite: Normally only available to students after completion of 84 credits. Note: Some independent study topics may not be eligible for science credit. Students should consult the School of Kinesiology and Health Science for application."
  },
  {
    "code": " Honours Thesis",
    "name": "HH/KINE 4100 6.00",
    "description": "Students complete a thesis involving empirical research. Students arrange for supervision by a faculty member of in the School of Kinesiology and Health Science. Contact the Undergraduate Office for details and application form. Prerequisites: Permission of the School of Kinesiology and Health Science; students must be in a Specialized Honours Program in Kinesiology and Health Science and have completed 84 credits. Note: Some Honours thesis topics may not be eligible for science credit."
  },
  {
    "code": " Honours Thesis",
    "name": "HH/KINE 4100A 6.00",
    "description": "Students complete a thesis involving empirical research. Students arrange for supervision by a faculty member of in the School of Kinesiology and Health Science. Contact the Undergraduate Office for details and application form. Prerequisites: Permission of the School of Kinesiology and Health Science; students must be in a Specialized Honours Program in Kinesiology and Health Science and have completed 84 credits. Note: Some Honours thesis topics may not be eligible for science credit."
  },
  {
    "code": " Nutritional Aids in Sport and Exercise",
    "name": "HH/KINE 4120 3.00",
    "description": "This course investigates the influence of nutritional supplements/aids on exercise performance, with emphasis on the underlying physiologic and biochemical mechanisms behind the effectives of ergogenic compounds. Prerequisites: HH/KINE 4010 3.00, HH/KINE 4020 3.00."
  },
  {
    "code": " Advanced Human Nutrition",
    "name": "HH/KINE 4130 3.00",
    "description": "Designed to provide a detailed analysis of the metabolic, biochemical and physiological processes that occur under health, exercise, altered nutritional status, and disease states. Prerequisite: HH/KINE 4010 3.00; HH/KINE 4020 3.00. Note: This is an advanced nutrition course that builds on the basic nutrition information acquired in HH/KINE 4020 3.00. It is designed to provide an in-depth analysis of the pathways that integrate the metabolism of carbohydrates, protein and fat. It also investigates the role of nutrition in the development and exacerbation of chronic diseases, and under different exercise states. It is targeted towards students interested in nutrition/physiology-related careers."
  },
  {
    "code": " Nutrition and Human Diseases",
    "name": "HH/KINE 4140 3.00",
    "description": "This course discusses nutrition as it affects muscle and human health. It discusses: nutrition and the immune system; nutrition and aging; ethnic nutrition and health; nutrition and the health of skeletal muscle; food and drug interaction; and nutrition in the treatment and prevention of selected human diseases including myopathies, cancer, cardiovascular disease, osteoporosis, and diabetes. Prerequisite: HH/KINE 4020 3.00."
  },
  {
    "code": " Disorders of Visual Cognition",
    "name": "HH/KINE 4210 3.00",
    "description": "We rely heavily on vision to interact with the world. This course investigates the clinical disorders that are manifested with impairments in different stages of visual processing. Prerequisite: HH/KINE 3020 3.00 or SC/BIOL 4370 3.00 or HH/PSYC 3250 3.00."
  },
  {
    "code": " Principles of Neurorehabilitation",
    "name": "HH/KINE 4226 3.00",
    "description": "Examines principles and clinical best practices for implementation of neurorehabilitation strategies following neurologic injury. Introduces processes of neuroplasticity and repair and the use of assistive technologies to facilitate neurorehabilitation interventions for upper and lower limb motor deficits. Prerequisites: HH/KINE 3020 3.00 Open to: Student majoring in Kinesiology and Health Science, Nursing, Psychology, Biology Note: Students must be available to engage 1.5 hours of off-campus group activity with a neurorehabilitation clinician/ researcher."
  },
  {
    "code": " Neuronal development for activity and health",
    "name": "HH/KINE 4230 3.00",
    "description": "Analyzes the cellular, molecular and physiological processes underlying neuronal and neuromuscular development in health and disease. Prerequisite: HH/KINE 3012 3.00."
  },
  {
    "code": " Applied Human Factors",
    "name": "HH/KINE 4240 3.00",
    "description": "Discusses human factors, e.g. sensory, perceptual, motor and cognitive systems, and how they feature in machines, systems design, procedures and skills, with an emphasis on physical activities and sport. Prerequisite: HH/KINE 3020 3.00 or SC/BIOL 4370 3.00 or HH/PSYC 3250 3.00."
  },
  {
    "code": " Sport, \"Race\" and Popular Culture in Canada",
    "name": "HH/KINE 4340 3.00",
    "description": "The course gives students a historical and contemporary understanding of \u0027race\u0027 and racism in Canadian popular culture as it pertains to the world of sport. Prerequisite: HH/KINE 1000 6.00. Note: This course does not count for science credit."
  },
  {
    "code": " Body as Light: Meditation Practices",
    "name": "HH/KINE 4370 3.00",
    "description": "Cross-cultural survey of training for enlightenment through meditation techniques, posture practices, and spiritual traditions. From prehistoric times our ancestors used repetitive physical activities to explore altered states of consciousness and to purify or illuminate the body/mind harmony as optimal health. Prerequisite: HH/KINE 1000 6.00. Note: This course does not count for science credit."
  },
  {
    "code": " Body as Weapon: Martial Arts/Combat Training",
    "name": "HH/KINE 4375 3.00",
    "description": "Cross-cultural survey of training for combat in military units, martial arts, and self defence. Fighting and war stand as two ancient yet enduring activities evoking study and systematic practice of lethal methods for using the body as a weapon against antagonists. Prerequisite: HH/KINE 1000 6.00. Note: This course does not count for science credit."
  },
  {
    "code": " Advanced Fitness/Lifestyle Assessment and Counselling",
    "name": "HH/KINE 4400 6.00",
    "description": "Students receive supervised, practical experience in designing, administering and interpreting fitness assessments along with the follow-up exercise counselling for athletes and the general public. Prerequisites: HH/KINE 3400 3.00; permission of the Instructor. Open only to students in the Certificate in Fitness Assessment and Exercise Counselling. Prerequisite or corequisite: HH/KINE 4010 3.00."
  },
  {
    "code": " Obesity: Assessment, Treatment and Implications",
    "name": "HH/KINE 4410 3.00",
    "description": "Obesity is a very prevalent condition that has received considerable attention. However, the attention has been very one sided, wherein only the benefits of weight loss are emphasized. The difficulties associated with maintaining weight loss are very poorly understood, and the dangers or negative aspects of focusing on weight per se may be more detrimental than the obesity itself. Prerequisites: HH/KINE 1020 6.0. Course Credit Exclusions: None."
  },
  {
    "code": " Relaxation: Theory and Practice",
    "name": "HH/KINE 4420 3.00",
    "description": "Focuses on an understanding of the physiological and psychological basis of relaxation as a self-management procedure and in the utilization of relaxation strategies in sport, health and physical activity. Prerequisites: HH/KINE 2031 3.00; HH/KINE 3011 3.00; HH/KINE 3012 3.00 or permission of the Instructor. Note: This course does not count for science credit."
  },
  {
    "code": " Relaxation II: Research and Application",
    "name": "HH/KINE 4421 3.00",
    "description": "This course reviews the research and application of self-regulation strategies (relaxation, biofeedback, imagery, cognitive restructuring and attention control) for performance and health enhancement. Three lecture hours per week. One term. Prerequisite: AS/HH/KINE 4420 3.00. Course credit exclusions: None."
  },
  {
    "code": " Business Skills for Sport and Fitness Professionals",
    "name": "HH/KINE 4430 3.00",
    "description": "This course includes theory and detailed practical instruction about key management/organizational processes and their successful application to sport and fitness-related business initiatives. PRIOR TO WINTER 2012: Course credit exclusions: HH/KINE 3250 3.00. Note: This course does not count for science credit."
  },
  {
    "code": " Advanced Exercise Physiology: Muscle",
    "name": "HH/KINE 4440 3.00",
    "description": "Advanced topics in exercise physiology and biochemistry, including energy metabolism, fatigue, skeletal muscle physiology, adaptations to exercise and training. Applications of exercise to disease states, animal laboratories, and discussions of original research articles in exercise physiology. Prerequisite: HH/KINE 4010 3.00."
  },
  {
    "code": " Advanced Exercise Physiology: Exercising and Surviving in Extreme Environments",
    "name": "HH/KINE 4442 3.00",
    "description": "An overview of the main physiological responses of the human body to exercising and surviving in extreme environments (hot, cold and humid environments, high altitude, diving, microgravity, air pollutants). Prerequisites: HH/KINE 2011 3.00, HH/KINE 3012 3.00, HH/KINE 4010 3.00."
  },
  {
    "code": " Living and performing at high altitude: The physiology of human adaptation to altitude hypoxia",
    "name": "HH/KINE 4443 3.00",
    "description": "Provides an in-depth analysis of the human physiological responses to altitude hypoxia including the acclimatization of the lowlander visiting altitude to the genetic adaptation of populations living at high altitude. These responses are analyzed from the perspective of integrative physiology as well as cellular and molecular mechanisms. Addresses the impact of hypoxia on human performance within the context of exercising at high altitude and using hypoxia to improve sea-level performance. Prerequisites: HH/KINE 2011 3.00, HH/KINE 3012 3.00"
  },
  {
    "code": " Sex Differences in Exercise Physiology",
    "name": "HH/KINE 4447 3.00",
    "description": "Explores sex differences in physiological responses to stressors, including exercise while investigating the roles of testosterone, estrogen and progesterone. This course covers sex differences at the level of the cell, tissue, and whole body and investigates cardiovascular, respiratory, muscular, bone, and autonomic responses. Exercise as a treatment for clinical conditions is also studied. Prerequisite: HH/KINE 4010 3.00."
  },
  {
    "code": " Advanced Human Physiology: Endocrinology",
    "name": "HH/KINE 4448 3.00",
    "description": "An overview of human endocrinology at the physiological, biochemical and molecular levels, with an emphasis on health, disease, exercise and adaptation. Prerequisite: HH/KINE 4010 3.00. Course credit exclusions: SC/BIOL 4320 3.00."
  },
  {
    "code": " Advanced Human Physiology: The Respiratory System in Health and Disease",
    "name": "HH/KINE 4449 3.00",
    "description": "This course guides the students through advanced concepts in respiratory physiology. The course discusses the structure, function and regulation of the respiratory system during physiological stresses and in the context of chronic diseases through the analysis of molecular and integrative physiology approaches. Prerequisite: HH/KINE 3012 3.00"
  },
  {
    "code": " Advanced Exercise Physiology: Cardiovascular",
    "name": "HH/KINE 4450 3.00",
    "description": "An overview of the cardiovascular physiology of exercise at both the central (heart) and peripheral (blood vessels, capillaries) levels, with an emphasis on health, disease, exercise and adaptation. Physiology adaptations at the molecular level are emphasized. Prerequisite: HH/KINE 4010 3.00."
  },
  {
    "code": " Vascular Function in Health and Disease",
    "name": "HH/KINE 4453 3.00",
    "description": "In-depth study of the physiology of the vascular system. These concepts then will be applied to understanding the pathophysiology of the vascular system in situations of chronic inflammation and diseases such atherosclerosis and hypertension. The beneficial effects of exercise on the vascular system will be discussed. Prerequisite: HH/KINE 4010 3.00."
  },
  {
    "code": " Occupational Biomechanics",
    "name": "HH/KINE 4460 3.00",
    "description": "Use of biomechanics in the occupational setting is introduced. Topics include workplace assessment techniques, risk factor identification, injury mechanisms, intervention strategies, and the (re)design of tools and workplace. Specific issues involving the upper extremity and lower back are addressed. Theory applied and practiced during labs. Prerequisite: HH/KINE 3030 3.00."
  },
  {
    "code": " Low Back Performance and Disorders",
    "name": "HH/KINE 4472 3.00",
    "description": "Introduces evidence-based exercises and strategies for optimal low back function, injury prevention, and rehabilitation. This advanced biomechanics course develops a strong foundation of anatomy, normal and injury mechanics, and motor control. Multidisciplinary issues related to low back performance and disorders are examined; including psychological, physiological, legislative, neuromuscular, and biomechanical. Theories applied and practiced during labs. Prerequisites: HH/KINE 3020 3.00, HH/KINE 3030 3.00."
  },
  {
    "code": " Sociology of Sport II",
    "name": "HH/KINE 4480 3.00",
    "description": "This course focuses on social problems in sport. Topics include inequality, sport as work, sport as a spectacle, and sport and the state. Three lecture hours per week. One term. Prerequisite: AS/HH/KINE 3620 3.00 or permission of the course director. Course credit exclusions: None. Note: This course does not count for science credit."
  },
  {
    "code": " Social Determinants of Physical Activity and Health in Canada",
    "name": "HH/KINE 4485 3.00",
    "description": "Introduces students to the political, economic and social factors that shape health, physical activity and sport opportunities and experiences of individuals and communities in Canada. Prerequisite: HH/KINE 1000 6.00. Note: This course does not count for science credit."
  },
  {
    "code": " Doctors, Trainers and Drugs: The Socio-Cultural Study of Sports and Medicine",
    "name": "HH/KINE 4495 3.00",
    "description": "Introduces students to the socio-cultural study of risk, violence, pain/injury tolerance and medicine in sport. This includes the historical development and social organization of sports medicine, as well as performance enhancement in sport. Prerequisite: HH/KINE 1000 6.00. Note: This course does not count for science credit."
  },
  {
    "code": " Neural Control of Movement",
    "name": "HH/KINE 4500 3.00",
    "description": "This neuroscience course reviews fundamental concepts of movement control, with an emphasis on the brain mechanisms underlying motor behaviour. Topics include walking, looking, reaching, posture and complex skill coordination. Movement control concepts will be used to understand the neural basis of symptoms associated with motor disorders such as Parkinson\u0027s disease, ataxia, Lou Gehrig\u0027s disease, muscular dystrophy, and stroke. Prerequisite: HH/KINE 3020 3.00 or HH/NRSC 2100 3.00 or SC/NRSC 2100 3.00 or permission of the Instructor."
  },
  {
    "code": " Neurophysiology of Movement in Health and Disease",
    "name": "HH/KINE 4505 3.00",
    "description": "Provides an overview of current neurophysiological concepts in motor control, with an emphasis on the neurophysiological principles underlying human movement disorders. Pre-requisites: HH/KINE 3012 3.00 or HH/KINE 3020 3.00 or HH/NRSC 2000 3.00 or SC/NRSC 2000 3.00 and HH/NRSC 2100 3.00 or SC/NRSC 2100 3.00"
  },
  {
    "code": " Mitochondria in Health and Disease",
    "name": "HH/KINE 4516 3.00",
    "description": "Analyzes the function and biogenesis of mitochondria with an emphasis on skeletal muscle. Apoptosis, mitochondrial disease, effects of exercise and training are examined at the molecular level. Current original literature is read and discussed in lecture and class presentation format. Prerequisite: HH/KINE 4010 3.00."
  },
  {
    "code": " Molecular Link Between Obesity and Cancer",
    "name": "HH/KINE 4518 3.00",
    "description": "There has long been an association between obesity and cancer. This course will examine the molecular mechanisms that underlie this deleterious association. Course content will examine cell cycle dysregulation in cancer. Aspects of diet, exercise, metabolism and endocrinology of adipose tissue will be explored and their roles in obesity-dependent cancer progression will be discussed. Prerequisites: HH/KINE 2011 3.00, HH/KINE 3012 3.00, and HH/KINE 4010 3.00. Course credit exclusions: SC/BIOL 4010 3.00."
  },
  {
    "code": " Sport Psychology Seminar",
    "name": "HH/KINE 4520 3.00",
    "description": "In-depth examination of selected topics in sport psychology: motivation, imagery, self-regulation and attention. The emphasis is on the application of mental training skills in sport settings. Prerequisite: HH/KINE 3000 3.00."
  },
  {
    "code": " Physical Activity and Children: Pedagogy",
    "name": "HH/KINE 4560 3.00",
    "description": "Examines teaching methods available for people working in a physical activity setting with children. Emphasis is placed on the core program components of dance, games and gymnastics. Curriculum and lesson planning for school based physical education is included. Prerequisites: HH/KINE 1020 6.00, HH/KINE 3000 3.00. Note: This course does not count for science credit."
  },
  {
    "code": " Meta-analysis and Systematic Reviews: Methodology and Interpretation",
    "name": "HH/KINE 4562 3.00",
    "description": "Examines the role of meta-analysis and systematic reviews in evidence-based medicine. Statistical and practical issues relating to the design and interpretation of meta-analyses and systematic reviews are emphasized. Undergraduate students will develop the skills to interpret and critique published studies and systematic reviews. Prerequisite: HH/KINE 2050 3.00 Pre/Corequisite:HH/KINE 3635 3.00 Course Credit Exclusion:GS/KAHS 5020 3.00"
  },
  {
    "code": " Epidemiology of Injury Prevention",
    "name": "HH/KINE 4565 3.00",
    "description": "Introduces students to the recognition of situations or practices that contribute to injuries, strategies for injury prevention, with an emphasis on an epidemiological/public health approach. Prerequisites: HH/KINE 1000 6.00; HH/KINE 2050 3.00."
  },
  {
    "code": " Experiential Field Placement in Athletic Therapy",
    "name": "HH/KINE 4592B 4.00",
    "description": "Provides students the knowledge and experience to offer evidence-based Athletic Therapy services and develop/implement sport injury prevention and management programs to special populations. Students will demonstrate Athletic Therapy skills including emergency action planning, clinical and field assessment and treatment, exercise prescription, and concussion management. Students will develop and demonstrate these skills in a field placement setting. Prerequisite: Permission of Instructor around corequisites and experience/qualifications. Corequisite: HH/KINE 4590 6.00. Notes: 1) Students will be responsible for arranging their own transportation to and from the placement. 2) Students must be in their last year of the Athletic Therapy Certificate Program and must have a current Vulnerable Sector Screening clearance letter."
  },
  {
    "code": " Athletic Therapy Integrative Seminar \u0026 Skills",
    "name": "HH/KINE 4593 3.00",
    "description": "Provides students with the required knowledge, psychomotor and communication skills relating to advanced integrative related case studies discussed in the field of Athletic Therapy. The course includes classroom focused experiential education through practical lab sessions, guest speakers and case studies. Skills will include (but are not limited to) functional/surface anatomy, taping/support techniques, clinical and field orthopaedic evaluation and tests, electrotherapeutic modality application, manual therapies, therapeutic exercise, and return to sport skills and decisions. Lab-based activities such as role-playing, mini-case study analysis, simulations and reflection will be integrated. Prerequisites: HH/KINE 3502 3.00, HH/KINE 3503 3.00 Corequisites: HH/KINE 4592 6.00 Open to: Athletic Therapy Certificate Program Students within Kinesiology and Health Science"
  },
  {
    "code": " Counselling Skills for Kinesiology and Health Science",
    "name": "HH/KINE 4620 3.00",
    "description": "Explores concepts, issues and skills related to \"embedded\" helping/counselling from a person-centred framework. Effective professional relationships and motivational interviewing are emphasized. Supervised skills practice is included. Relevant to persons working in health care, education and community services. Prerequisite: HH/PSYC 1010 6.00. Note: This course does not count for science credit."
  },
  {
    "code": " Active Living and Ageing",
    "name": "HH/KINE 4645 3.00",
    "description": "The purpose of this course is to assist students in developing insight into the physical and health needs of the elderly. Emphasis is placed upon identifying active ageing opportunities and exploring environments in which physical activity is integrated into daily living. Prerequisite: AS/HH/SC KINE 3350 3.00. Course credit exclusions: None. Note: This course does not count for science credit."
  },
  {
    "code": " Delivering Exercise to the Aging: Knowledge to Action",
    "name": "HH/KINE 4646 3.00",
    "description": "Delivering Exercise to the Aging: a continuum from evidence-based knowledge to clinical application. Students first review current knowledge of age-related physiological, social and psychological changes confronting individual and population health. Next studied are the attenuating effects of exercise. Finally, students apply the Knowledge Translation framework to design a program to meet the needs of an aging cohort in their community. Prerequisite: HH/KINE 1020 6.00 Pre/Corequisite: HH/KINE 4010 3.00."
  },
  {
    "code": " Sport, Physical Activity and Youth Development",
    "name": "HH/KINE 4650 3.00",
    "description": "Explores developmental theories and psychosocial research that facilitate understanding of positive youth development through sport and physical activity. Students will be introduced to theoretical and empirical research from developmental psychology and sport psychology fields. Specific discussions and applications will focus on conditions that facilitate youths\u0027 healthy involvement in sport and physical activity. Prerequisite: HH/KINE 3000 3.00."
  },
  {
    "code": " Advanced Social and Psychological Contributors to Exercise Behaviour",
    "name": "HH/KINE 4680 3.00",
    "description": "Focuses on the social and psychological antecedents and consequences of exercise behaviour. Emphasis is placed on understanding concepts, principles, and theories and how these may be applied to research as well as the promotion and maintenance of exercise. Prerequisite: HH/KINE 3000 3.00."
  },
  {
    "code": " Psychology of Health and Chronic Disease",
    "name": "HH/KINE 4710 3.00",
    "description": "Explores the role of psychological variables in the development, progression and treatment of chronic diseases such as coronary heart disease, cancer and AIDS. Other critically reviewed topics include stress, substance abuse (smoking and alcohol), and injury and violence. Prerequisite: HH/PSYC 1010 6.00. Course credit exclusions: HH/PSYC 3170 3.00."
  },
  {
    "code": " Secondary Prevention of Heart Disease: Cardiac Rehabilitation in a Global Context",
    "name": "HH/KINE 4720 3.00",
    "description": "Examines the secondary prevention of cardiovascular disease from a behavioural, psychosocial and health services lens. Major emphasis is placed on cardiac rehabilitation, with regard to delivery, effects on health outcomes, and equitable access. Development of cardiac rehabilitation in low-resource settings, and global efforts in control of non-communicable diseases will also be examined. Corequisite: HH/GH 2100 3.00 or HH/IHST 2100 3.00 or HH/KINE 2049 3.00 or HH/NURS 3515 3.00 Cross-listed to: HH/GH 4720 3.00, HH/NURS 4700 3.00 Course Credit Exclusions: HH/IHST 4720 3.00"
  },
  {
    "code": " Psychology of Sport Injury and Rehabilitation",
    "name": "HH/KINE 4740 3.00",
    "description": "This course deals with the psychosocial aspects of sport injury. Through this course, the students gain an understanding of the psychological and sociological aspects of sport injury, the impact of pain, and the psychological implications of long term rehabilitation. Psychological interventions are highlighted within case histories and a return to an active lifestyle is the goal of the interventions. Prerequisite: HH/PSYC 1010 6.00."
  },
  {
    "code": " Exercise Therapy for Chronic Diseases",
    "name": "HH/KINE 4900 3.00",
    "description": "An overview of the use of exercise and physical activity in the evaluation and treatment of a variety of chronic diseases and disabilities. Prerequisite: HH/KINE 4010 3.00."
  },
  {
    "code": " Frontiers of Neuroscience",
    "name": "HH/NRSC 1001 1.00",
    "description": "Introduces the breadth of research directions of faculty members at York University within the field of neuroscience. Familiarizes students with professionalism, research ethics, and explores neuroscience related facilities and organizations in the wider community. Open to: Honours and Specialized Honours BSc students Notes: This course is expected to be completed within the first 30 credits of study but if needed students can be given the opportunity to enroll in this course if they have not yet completed 60 credits."
  },
  {
    "code": " Fundamental Molecular and Cellular Neuroscience",
    "name": "HH/NRSC 2000 3.00",
    "description": "Survey of the key areas of neuroscience including a historic perspective, gross anatomy and histology of the nervous system, development of the nervous system, molecular and cellular neuroscience, and neurological disorders. Introduces methodologies of research and experimentation in neuroscience. Prerequisites: SC/BIOL 1000 3.00; SC/BIOL 1001 3.00; HH/PSYC 1010 6.00 Open to: Honours and Specialized Honours BSc students Cross-listed to: SC/NRSC 2000 3.00"
  },
  {
    "code": " Systems, Behavioral, and Cognitive Neuroscience",
    "name": "HH/NRSC 2100 3.00",
    "description": "Explores the structure and function of the human brain. Topics include the organization of the central nervous system, the function and neural basis of sensory and movement systems, consciousness, language, thought and memory. Prerequisites: HH/NRSC 2000 3.00 or SC/NRSC 2000 3.00 Open to: Honours and Specialized Honours BSc students Cross-listed to: SC/NRSC 2100 3.00"
  },
  {
    "code": " Neuroscience Techniques",
    "name": "HH/NRSC 2200 3.00",
    "description": "Provides students with an overview of and exposure to experimentation techniques and methodologies in the fields of systems and cognitive, cellular and molecular, and computational and theoretical neuroscience. These could include any of the following: EEG, fMRI, behavioural methods such as psychophysics and eye/body tracking, electrophysiology, patch and dynamic clamp, transgenic mouse technology, molecular imaging, neuronal coding and communication, neuronal networks, and brain-machine interfaces. Prerequisites: HH/NRSC 2000 3.00 or SC/NRSC 2000 3.00; HH/NRSC 2100 3.00 or SC/NRSC 2100 3.00 Corequisites: HH/NRSC 2100 3.00 or SC/NRSC 2100 3.00 Open to: Honours and Specialized Honours BSc students Cross-listed to: SC/NRSC 2200 3.00"
  },
  {
    "code": " Molecular and Cellular Neurobiology",
    "name": "HH/NRSC 3000 3.00",
    "description": "Explores the molecular, structural and cellular basis of complex brain functions focusing on perception, learning and memory. Discuss technological advances in areas of genome engineering, optogenetics, imaging and animal models used in the field. Examples of human neurological disease conditions are used whenever appropriate to exemplify the consequences of sensory deficiencies in the nervous system. Prerequisites: HH/NRSC 2000 3.00 or SC/NRSC 2000 3.00 and HH/NRSC 2100 3.00 or SC/NRSC 2100 3.00 Corequisites: HH/NRSC 2200 3.00 or SC/NRSC 2200 3.00 Open to: Honours and Specialized Honours BSc students Cross-listed to: SC/NRSC 3000 3.00"
  },
  {
    "code": " Collaborative Nursing - Seneca",
    "name": "HH/NURS 1000S 30.00",
    "description": "First-year Nursing completed at Seneca College."
  },
  {
    "code": " Collaborative Nursing - Georgian",
    "name": "HH/NURS 1000G 30.00",
    "description": "First-year Nursing completed at Georgian College."
  },
  {
    "code": " Reflection and Relational Practice in Professional Nursing",
    "name": "HH/NURS 1510 3.00",
    "description": "Introduces nursing as a self-regulated health profession that is guided by theory, research and standards of practice. Learners explore professional identity as a nurse, relational practice, reflection, self-awareness, the meaning of health and the nature of collaborative practice in Canada. Use of clinical examples supports the development of writing and oral skills for self-reflection and communication in nursing. Corequisite: HH/NURS 1542 3.00 Open to: BScN students in the 4-year Direct Entry program only. Notes: A minimum grade of 5.00 (C+) is required for this course in the BScN program."
  },
  {
    "code": " Nursing Theory and Knowledge Development",
    "name": "HH/NURS 1511 3.00",
    "description": "Reviews the history of nursing and development of the scientific and theoretical basis of nursing practice with an emphasis on multiple ways of knowing. The evolution of nursing as a self-regulating and unique profession is explored. The impact of evidence is emphasized. Critical analysis of theory and practice supports familiarization with nursing literature, information literacy and development of scholarly writing. Prerequisite: HH/NURS 1510 3.00 Open to: BScN students in 4-year Direct Entry program Note: A minimum grade of 5.00 (C+) is required in this course for the BScN program."
  },
  {
    "code": " Reflection and Theory-based Practice in Professional Nursing",
    "name": "HH/NURS 1512 3.00",
    "description": "Introduces nursing as a self-regulated health profession that is guided by theory, research and standards of practice. Learners explore professional nursing identity through reflection on personal experiences and exposure to the evolution of the profession as a scientific discipline. Critical analysis of theory and research familiarizes learners with nursing literature, information literacy, interprofessional collaboration, and facilitates scholarly writing skills. Co-requisite for 2nd Entry BScN students: HH/NURS 2543 3.00 Open to: BScN students in the 2nd Entry program Note: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Health and Well-Being",
    "name": "HH/NURS 1542 3.00",
    "description": "Introduces nursing therapeutics through concepts of health and wellness for clients across the lifespan. Provides the theoretical and evidence informed basis for basic nursing practices with the opportunity for students to apply knowledge and skills through various experiences in simulation and laboratory settings. Co-requisite(s): HH/NURS 1510 3.00. Open to: BScN students in the 4-year Direct Entry program. Note: A minimum grade of 5.00 (C+) is required for this course in the BScN program."
  },
  {
    "code": " Health Assessment",
    "name": "HH/NURS 1543 3.00",
    "description": "Utilizes theory and practice of health assessment and therapeutic communication to support students\u0027 demonstration of focused history-taking and physical examination skills. Focused assessments skills include physical, psychosocial and other related aspects for clients across the lifespan. Inherent safety considerations, biases and assumptions embedded in traditional client assessments will be discussed and practiced in laboratory settings. Prerequisite: Prerequisites for 4-year Direct Entry BScN students: HH/NURS 1542 3.00, HH/KINE 1101 3.00. Open to: students in the BScN programs. Note: A minimum grade of 5.00 (C+) is required in this course in the BScN program."
  },
  {
    "code": " Practicum for HH/NURS 1900 6.00",
    "name": "HH/NURS 1900P 0.00",
    "description": "Students enrolled in HH/NURS 1900 6.00 must also enrol in this mandatory practicum."
  },
  {
    "code": " Collaborative Nursing- Seneca College - 3rd Term",
    "name": "HH/NURS 2003S 15.00",
    "description": "N/A"
  },
  {
    "code": " Collaborative Nursing- Georgian College - 3rd Term",
    "name": "HH/NURS 2003G 15.00",
    "description": "N/A"
  },
  {
    "code": " Collaborative Nursing - Georgian College - 4th Term",
    "name": "HH/NURS 2004G 15.00",
    "description": "N/A"
  },
  {
    "code": " Collaborative Nursing - Seneca College - 4th Term",
    "name": "HH/NURS 2004S 15.00",
    "description": "N/A"
  },
  {
    "code": " Statistical Methods in Healthcare Research",
    "name": "HH/NURS 2300 3.00",
    "description": "Introduces the concepts of quantitative data analysis within the context of nursing research. Focuses on understanding and interpreting research results through examination of nursing research. Examines the fit between research purpose and results, and results and implications for nursing practice. Course credit exclusions: HH/PSYC 2021 3.00, HH/KINE 2050 3.00. Open to: students in the Post RN IEN BScN program. Note 1: Recommend HH/NURS 2300 3.00 be completed prior to or concurrently with HH/NURS 3300 3.00 or equivalent. Note 2: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Ethics and Health Equity in Interprofessional Practice",
    "name": "HH/NURS 2513 3.00",
    "description": "Focuses on bioethical theories, health equity, and related concepts and current issues relevant to nursing and other health professionals\u0027 practice. Reflection on self-beliefs and the meaning of collaboration with various clients and other practitioners occurs in the context of ethical decision making and the application of various ethical frameworks. The impact on client health and autonomy are explored. Prerequisites: Prerequisites for 4-year Direct Entry BScN students: HH/NURS 1511 3.00. Prerequisites for 2nd Entry BScN students: HH/NURS 1512 3.00. Course Credit Exclusion(s): HH/NURS 3400 3.00. Open to: Students in the BScN programs, and by permission to Faculty of Health students. Note: A minimum grade of 5.00 (C+) is required for this course for in the BScN program."
  },
  {
    "code": " Introduction to Social Justice and Advocacy in Nursing Practice",
    "name": "HH/NURS 2514 3.00",
    "description": "Introduces the concept of social justice and the practice of advocacy as indispensable components of ethical and competent nursing practice. Related issues of equity, rights, structures, oppression, exclusion, bio-power, neoliberalism, moral courage and the social determinants of health are explored. Students examine concepts as they reflect on their current and envisioned practice as a nurse and advocate. Prerequisite: HH/NURS 2513 3.00 for 4-year Direct Entry BScN students Co-requisite: HH/NURS 2513 3.00 for 2nd Entry BScN students Open to: students in the 4-year Direct Entry and 2nd Entry BScN programs. Note: A minimum grade of 5.00 (C+) is required for this course in the BScN program."
  },
  {
    "code": " Pathophysiology, Pharmacological and Knowledge Integration I",
    "name": "HH/NURS 2535 3.00",
    "description": "Introduces the mechanisms of disease, alterations in function, resultant clinical manifestations and selected treatment interventions required in nursing care of the client. Underlying concepts are examined for the impact on the structure and function of the body. Principles of pharmacokinetics and pharmacodynamics and examples of pharmacological interventions are introduced. Application of pathophysiology and pharmacology to nursing practice will be examined. Prerequisite for 4-year Direct Entry: HH/KINE 1102 3.00 Open to: Students in the 4-year Direct Entry and 2nd Entry BScN Programs Note: A minimum grade of 5.00 (C+) is required for this course in the BScN program."
  },
  {
    "code": " Health of Families and Social Groups",
    "name": "HH/NURS 2543 3.00",
    "description": "Focuses on communication with, assessment of, and interventions for diverse families and social groups to achieve client-centered optimal health and well-being. Through classroom and laboratory/simulation experiences, students develop foundational skills and learn about evidence-informed nursing care for clients in the context of family and social groups, considering culture, diverse identities, and other perspectives Corequisites: Co-requisite for 2nd Entry BScN students: HH/NURS 1512 3.00 Co-requisite for Post-RN IEN BScN students: HH/NURS 3513 3.00 Open to: 2nd Entry and Post-RN IEN BScN students Notes: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Trends and Contemporary Issues for the Aging Adult in Canada",
    "name": "HH/NURS 3000 3.00",
    "description": "Presents aging as a normal part of the life cycle and explores topics that demonstrate quality of life at every age. Examines current trends and issues for the aging adult in Canada with a nursing focus. Explore current topics such as ageism, sexuality, technology, abuse, care giving, mental wellness, cross-cultural issues and the positive contributions of older adults. Open to: York University BScN students. Note: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " The Canadian Health Care System",
    "name": "HH/NURS 3001 3.00",
    "description": "Examines components of the Canadian healthcare system, roles of governments and professional health organizations, contemporary issues of safety, cost control, organization and delivery of health services. Students identify how the relationships among healthcare professionals, and the levels of the health system impact the health of Canadians. Expression of ideas through scholarly writing is supported. Course Credit Exclusion: HH/NURS 4710 3.00 Open to: 2nd Entry and Post-RN IEN BScN students Note: A minimum grade of 5.00 (C+) is required for this course in the BScN program."
  },
  {
    "code": " Health and Healing: Promoting Health and Healing with Individuals and Families",
    "name": "HH/NURS 3130 3.00",
    "description": "Philosophies and theories of health promotion and healing are critically examined. Students explore the meaning of health promotion with individuals in families, within a caring-healing perspective. Note: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Creating Intercultural Safety",
    "name": "HH/NURS 3200 3.00",
    "description": "Global health requires students to understand the core concepts in understanding and navigating \"differences\" as these are socially produced and embedded within power relations. Students critically examine theoretical approaches to cultural safety, cultural competence and anti-oppression to develop an integrative approach to intercultural awareness and safety. Working with a broad definition of culture that explicitly includes an intersectional understanding of culture/diversity students explore the impact of cultural patterns and social locations on self and others. Through reflective assignments, students gain insight into their own cultural positionality and explore how to be an affective ally and advocate to promote equity and health for all. Understanding varied definitions of health and healing and different approaches to communication are fundamental tools for developing effective health care policies, strategies, and care approaches. Prerequisites: HH/GH 1010 3.00 or HH/HLST 1010 3.00 or HH/IHST 1010 3.00 or HH/PSYC 1010 6.0 Cross-listed to: HH/NURS 3200 3.00 Course Credit Exclusions: HH/IHST 3200 3.000 6.00 Note: This course does not count as a science credit for BSc degree programs. Previously Offered as HH/IHST 3200 3.00"
  },
  {
    "code": " Partnering with Communities",
    "name": "HH/NURS 3510 6.00",
    "description": "Develops knowledge and skill in the process of partnering with communities to address health inequities. Using knowledge of population health, primary health care, community development, critical health promotion, social determinants of health and CHNC standards of practice, the roles, ethics and approaches related to community health nursing practice are explored in the classroom and applied in a preceptored community-based practicum. Prerequisites: Prerequisite for 4-year Direct Entry BScN students: HH/NURS 2514 3.00, HH/NURS 2547 6.00. Prerequisite for 2nd Entry students: HH/NURS 2543 3.00, HH/NURS 3515 3.00. Prerequisite for Post-RN IEN BScN program students: HH/NURS 2543 3.00 Course Credit Exclusions: HH/NURS 4525 6.00, HH/NURS 4120 6.00, AK/NURS 4140 6.00 (prior to Summer 2005) Open to: BScN students only Note 1: Students need to pass both practicum and classroom components in order to pass the course and are responsible for providing their own transportation to and from the practicum sites. Note 2: A minimum grade of 5.00 (C+) is required for this course in the BScN program. Note 3: Enrolled students who failed to achieve the minimum grade of 5.00 (C+) in course prerequisites will be ineligible to proceed/withdrawn from this course."
  },
  {
    "code": " Practicum for HH/NURS 3510 6.00",
    "name": "HH/NURS 3510P 0.00",
    "description": "Students enrolled in HH/NURS 3510 6.00 must also enrol in this mandatory practicum."
  },
  {
    "code": " Development as a Nurse Through Reflection and Theory",
    "name": "HH/NURS 3513 3.00",
    "description": "Introduces nursing as a self-regulated health profession that is guided by theory, research and standards of practice, for learners with nursing care backgrounds. Personal experiences, self-awareness, nursing history, reflective and relational practice, and health are examined. Critical analysis of theory familiarizes learners with nursing literature and develops information literacy and scholarly writing skills. The significance of interprofessional collaboration is emphasized. Open to: Post-RN IEN BScN students Note 1: A minimum grade of 5.00 (C+) is required in this course for the BScN degree. Note 2: Students admitted prior to Fall 2022 will be expected to meet the course prerequisite requirements that were in effect at the time that they were admitted to their respective undergraduate program. Please see reference to this in the program descriptions, as applies."
  },
  {
    "code": " Leadership, Change and Innovation",
    "name": "HH/NURS 3514 3.00",
    "description": "Applies leadership and change theories, innovation and evidence informed approaches to client centred care and the practice of nursing. Examines client centered and socio-political influences on the delivery of nursing care, and evaluates the significance of leadership, change and innovative strategies on client health outcomes and healthcare systems. Describes the nursing role in complex client management situations such as local emergency preparedness and disaster and resource management. Prerequisites: Prerequisite for 4-year Direct Entry: HH/NURS 2514 3.00. Prerequisite for 2nd Entry BScN students: HH/NURS 2513 3.00, HH/NURS 2514 3.00. Prerequisite for Post-RN IEN BScN students: HH/NURS 2513 3.00. Course Credit Exclusion(s): HH/NURS 3050 3.00 (prior to Winter 2012), HH/NURS 4000 3.00. Open to students in the BScN programs. Note 1: A minimum grade of 5.00 (C+) is required for this course in the BScN program. Note 2: Students admitted prior to Fall 2022 will be expected to meet the course prerequisite requirements that were in effect at the time that they were admitted to their respective undergraduate program. Please see reference to this in the program descriptions, as applies."
  },
  {
    "code": " Evidence-informed Nursing Practice: Research and Inquiry",
    "name": "HH/NURS 3515 3.00",
    "description": "Introduces students to nursing and health research and evidence informed practice (EIP). Students examine qualitative and quantitative research designs and methods used in nursing and healthcare knowledge development and are introduced to models of EIP. Students learn to critique research in order to determine the applicability and usefulness of research findings to the provision of high-quality nursing and health care. Prerequisites: Prerequisites for 4-year Direct Entry: HH/PSYC 2021 3.00. Prerequisite for Post-RN IEN BScN students: HH/NURS 2300 3.00. Course Credit Exclusion: HH/NURS 3300 3.00, AP/ADMS 2300 6.00. Open to students in the BScN programs. Note 1: A minimum grade of 5.00 (C+) is required for this course in the BScN program. Note 2: Students admitted prior to Fall 2022 will be expected to meet the course prerequisite requirements that were in effect at the time that they were admitted to their respective undergraduate program. Please see reference to this in the program descriptions, as applies."
  },
  {
    "code": " Practicum for HH/NURS 3524 6.00",
    "name": "HH/NURS 3524P 0.00",
    "description": "Students enrolled in HH/NURS 3524 6.00 must also enrol in this mandatory practicum."
  },
  {
    "code": " Health and Healing: Client Centred Care of Individuals and Families in Child and Mental Health Settings",
    "name": "HH/NURS 3524 6.00",
    "description": "Emphasizes planning and implementing caring/healing and health promotion activities with culturally diverse individuals and families in child health and mental health settings. A specific human science theory informs the construction and interpretation of client-centred approaches to care in each setting. Integrates current theory drawn from both within and outside of nursing with opportunities for clinical application through practicum placements. Prerequisites: HH/NURS 2523 6.00, HH/NURS 2534 3.00, HH/NURS 2512 3.00, HH/NURS 2513 3.00, HH/NURS 4525 6.00 (for second Entry BScN students only). Students who failed to achieve the minimum grade of 5.00 (C+) in course prerequisites will be ineligible to proceed/withdrawn from this course. Course Credit Exclusion: HH/NURS 3910 6.00. Open to: Students in the York-Seneca-Georgian Collaborative and 2nd Entry BScN Programs. Note: Students need to pass both classroom and both practicum components in order to pass the course. Students must provide their own transportation to practicum placements."
  },
  {
    "code": " Nurses\u0027 Experience in Health Care Environments",
    "name": "HH/NURS 3710 3.00",
    "description": "Explores the lived experience of nurses in diverse healthcare settings. Through reading, dialogue, writing, on-site classes and guest conversations, students will transform their understanding of the experience of working in healthcare reform environments in which stories intermingle. Note: Open only to students in the BScN programs. Note: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Health Care Planning for Communities",
    "name": "HH/NURS 3740 3.00",
    "description": "This course provides a theoretical and methodological background for health problem analysis and program/service planning at the community and regional levels. Cross-listed to: HH/NURS 3740 3.00 Course Credit Exclusions: HH/IHST 3740 3.00 Previously Offered as HH/IHST 3740 3.00"
  },
  {
    "code": " Leadership Development: Part I",
    "name": "HH/NURS 3770 3.00",
    "description": "This course focuses on nursing management roles and functions, organizational structure and processes and the management of human resources in a variety of health care settings. Prerequisites: For students in the collaborative BScN program, HH/NURS 3040 3.00; for students in the Post-RN BScN program, HH/NURS 3010 3.00. Note: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Clinical Decision-Making in Nursing Practice",
    "name": "HH/NURS 3780 3.00",
    "description": "Extends the foundational preparation of the nursing process to explore theoretical frameworks influencing nurse decision-making in health care settings. Analyzes the nature of novice-to-expert thinking patterns, and the challenges for its development in entry level nursing practice. Applies concepts of clinical reasoning and judgment to complex and varied nursing care scenarios, and critiques person-centred outcomes in relation to safe and effective care. Prerequisites: For second Entry BScN students - completion of all 2000-level courses; For Collaborative BScN students- Completion of first- and second-year courses. Open to: BScN student only. Note 1: May be offered in face to face, or blended format; mandatory lab component. Note 2: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Directed Reading",
    "name": "HH/NURS 3800 3.00",
    "description": "Students select an area for extensive reading and writing. Specific areas to be selected in consultation with an appropriate faculty member. Prerequisite: Students must be accepted by a faculty supervisor before they can register in this course. The course transaction form for this course must be submitted with the signature of the supervisor indicating willingness to supervise. Permission of the undergraduate director is also required. Open to: Students in the Post-RN BScN program. Note: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Directed Reading",
    "name": "HH/NURS 3800 6.00",
    "description": "Students select an area for extensive reading and writing. Specific areas to be selected in consultation with an appropriate faculty member. Prerequisite: Students must be accepted by a faculty supervisor before they can register in this course. The course transaction form for this course must be submitted with the signature of the supervisor indicating willingness to supervise. Permission of the undergraduate director is also required. Note: Open only to students in the Post-RN BScN program. Note: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Pharmacological and Non-pharmacological Practices",
    "name": "HH/NURS 3901 3.00",
    "description": "Emphasizes the professional nursing role in administration and evaluation of therapeutic interventions including harmacological and non-pharmacological practices in the Canadian healthcare context. A review of drug classes, pharmacokinetics, pharmacodynamics and specific nursing therapeutic regimens, as well as issues of medication safety and health system informatics, are presented. Examines evidence informed standards and policy for safe and competent nursing practice. Open to Post-RN IEN BScN students. Note: A minimum grade of 5.00 (C+) is required for this course in the BScN program."
  },
  {
    "code": " Development of Self: Communicating and Relating In Complex Situations",
    "name": "HH/NURS 3950 3.00",
    "description": "Examines complex communication skills and explores how they influence the nurse\u0027s effectiveness working with client groups, collaborating on interdisciplinary teams and supporting families. Note: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Practicum for HH/NURS 4131 6.00",
    "name": "HH/NURS 4131P 0.00",
    "description": "Students enrolled in HH/NURS 4131 6.00 must also enrol in this mandatory practicum."
  },
  {
    "code": " Client Centered Care in the Canadian Context",
    "name": "HH/NURS 4131 6.00",
    "description": "Focuses on the care of patients and families within complex care situations using a client and family centred approach. Utilizes practice experience in Ontario healthcare settings to highlight essential competencies necessary for nursing practice in Canada. Prerequisite: HH/NURS 2731 6.00. Open to: Students admitted to the qualifying pre-session of the Post-RN IEN BScN program only. Note: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " The History and Health of Indigenous Individuals, Families and Communities",
    "name": "HH/NURS 4370 3.00",
    "description": "Analyzes the impact of the history of Indigenous Peoples of Canada from a nursing perspective. Studies colonization, the Report of the Truth and Reconciliation Commission of Canada (TRCC), and other relevant materials to inform and provide context to the examination of topics related to Indigenous Health. Explores meaning of traditional healing, cultural safety and nursing praxis in Indigenous communities. Open to: Students in the York-Seneca-Georgian Collaborative and 2nd Entry BScN Programs. Note: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Development of Self as Nurse: Advanced Professional Issues",
    "name": "HH/NURS 4516 3.00",
    "description": "Prepares students for transitioning into the workforce by examining the context of nursing practice within the Canadian health care system, analyzing current workplace and professional issues which influence nurses\u0027 roles in health care, and developing skills related to seeking employment. Prerequisite: HH/NURS 3514 3.00. Prerequisite or corequisite for Collaborative students: HH/NURS 4525 6.00, HH/NURS 4526 6.00. Prerequisites or corequisites for second Entry students: HH/NURS 4525 6.00, HH/NURS 3524 6.00. Note: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Practicum for HH/NURS 4525 6.00",
    "name": "HH/NURS 4525P 0.00",
    "description": "Students enrolled in HH/NURS 4525 6.00 must also enrol in this mandatory practicum."
  },
  {
    "code": " Health and Healing: Community as Partner",
    "name": "HH/NURS 4525 6.00",
    "description": "This course focuses on the community as partner. Knowledge and skills related to caring for the community will be explored. The roles, concepts, and theories related to promoting of communities, using population-focused approach, will be critically examined and applied in practice. A practicum with a minimum of 144 hours over a 12 week semester provides opportunity for praxis. Prerequisites for Collaborative BScN students: HH/NURS 3524 6.00. Prerequisite or corequisite for Collaborative BScN students: HH/NURS 3515 3.00, HH/NURS 3514 3.00. Prerequisite for second Entry BScN students: HH/NURS 2523 6.00. Prerequisite for Post RN IEN students: HH/NURS 4131 6.00. PRIOR TO FALL 2012: course credit exclusion: HH/NURS 4120 6.00. Notes: Students need to pass both practicum components in order to pass the course and are responsible for providing their own transportation to and from practicum sites. 2nd Entry and Post RN IEN students who failed to achieve the minimum grade of 5.00 (C+) in course prerequisites will be ineligible to proceed/withdrawn from this course."
  },
  {
    "code": " Practicum for HH/NURS 4526 6.00",
    "name": "HH/NURS 4526P 0.00",
    "description": "Students enrolled in HH/NURS 4526 6.00 must also enrol in this mandatory practicum."
  },
  {
    "code": " Health and Healing: Client Centred Care of Individuals and Families in Homes and Acute Settings",
    "name": "HH/NURS 4526 6.00",
    "description": "Integrates the theoretical and practice components of family/client-centred nursing care with clients experiencing acute or chronic health challenges. Through classroom and practicum experiences, students expand their knowledge of the therapeutic role of nursing care of individuals and families in homes and acute care settings. Prerequisite: HH/NURS 3524 6.00. Prerequisites or corequisites: HH/NURS 3514 3.00, HH/NURS 3515 3.00. Students who failed to achieve the minimum grade of 5.00 (5.00 (C+)) in course prerequisites will be ineligible to proceed/withdrawn from this course. Course credit equivalent: HH/NURS 4130 6.00. Open to: Students in the York-Seneca-Georgian Collaborative BScN Program. Note: Students need to pass both classroom and practicum components in order to pass the course. Students are responsible for their own transportation to and from practice placements"
  },
  {
    "code": " Health \u0026 Healing: Integrated Nursing Science Practicum",
    "name": "HH/NURS 4527 9.00",
    "description": "Intensive practice experience in a variety of traditional and non-traditional nursing settings. Synthesizes previous knowledge to help students articulate a framework for professional and clinical practice. This course totals 432 practicum experience hours. Prerequisites: Successfully earned (completed) all prior BScN program courses. Corequisite: HH/NURS 4528 3.00. Students who failed to achieve the minimum grade of 5.00 (C+) in course prerequisites will be ineligible to proceed/withdrawn from this course. Course credit exclusions: HH/NURS 4110 9.00, HH/NURS 4900 9.00. Only open to: Collaborative and second Entry BScN students. Notes: Students must successfully complete both HH/NURS 4527 9.00 and HH/NURS 4528 3.00 concurrently in order to be recognized with a passing grade or credit in either course. Students are responsible for their own transportation to and from practicum sites."
  },
  {
    "code": " Health and Healing: Integrated Nursing Science Theory",
    "name": "HH/NURS 4528 3.00",
    "description": "Synthesizes previous knowledge to help students articulate a framework for professional and clinical practice and apply to an intensive practice experience in a variety of traditional and non-traditional nursing settings. This course is equivalent to 36 classroom contact hours. Prerequisites: Successfully earned (completed) all prior BScN program courses. Corequisite: HH/NURS 4527 9.00. Course credit exclusions: HH/NURS 4111 3.00, HH/NURS 4901 3.00. Only open to: Collaborative and 2nd Entry BScN students. Note 1: Students must successfully complete both HH/NURS 4527 9.00 and HH/NURS 4528 3.00 concurrently in order to be recognized with a passing grade or credit in either course. Note 2: Students are responsible for their own transportation to and from practicum sites. Note 3: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Health and Healing: Global Context of Nursing",
    "name": "HH/NURS 4546 3.00",
    "description": "Focuses on global issues and trends related to present and future scenarios of human and planetary health. Caring, the central concept in nursing is explored within the global context. Nurses\u0027 roles, responsibilities and actions are examined in relation to the promotion of global health. Prerequisites or corequisites for BScN program: all 3000-level courses. Post-RN Course credit exclusion: HH/NURS 4100 3.00 (prior to Fall 2012). Open to: students in the York BScN program. Note: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Human Experience of Chronic Health Challenges",
    "name": "HH/NURS 4610 3.00",
    "description": "Focus on human experience of living with chronic health challenges from perspectives of individuals, their families and caregivers, and the health care system. Explores personal accounts and reflections. Analyzes concepts, theories and relevant literature. Discussion focuses on current relevant issues. Prerequisites: For students in Collaborative BScN program, HH/NURS 3040 3.00 and HH/NURS 3300 3.00; for students in Post-RN BScN program, HH/NURS 3040 3.00 and HH/NURS 3300 3.00; or for students with equivalent preparation, permission of the Instructor. Note 1: Open only to students in the BScN program. Note 2: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Women\u0027s Health and Women\u0027s Health Movements: Critical Perspectives",
    "name": "HH/NURS 4620 3.00",
    "description": "Through a collaborative learning environment, students will critically analyze issues affecting women\u0027s health/health care including pathologization, medicalization, women healers, women\u0027s mental health, body image, environmental and occupational health, sexuality, violence, diversity and societal marginalization, gender roles and women\u0027s health research. Note 1: Open only to students in the BScN program or with permission of the undergraduate director. Note 2: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Advanced Paediatric Nursing",
    "name": "HH/NURS 4650 3.00",
    "description": "Building on the fundamental content of HH/NURS 3524 6.00, this course will develop further depth and breadth of nursing knowledge related to the care of infants, children and youth. Through classroom learning, students will develop beginning expertise in the knowledge, skill and judgment critical for paediatric nursing. This course is suited to those who have an interest in a career in paediatrics. Prerequisite: HH/NURS 3524 6.00 for collaborative students. Prerequisite or corequisite: HH/NURS 3524 6.00 for second degree entry or by permission of the Instructor. Notes: 1) This course is best suited for those students who have had a paediatric placement in HH/NURS 3524 3.00. 2) A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Secondary Prevention of Heart Disease: Cardiac Rehabilitation in a Global Context",
    "name": "HH/NURS 4700 3.00",
    "description": "Examines the secondary prevention of cardiovascular disease from a behavioural, psychosocial and health services lens. Major emphasis is placed on cardiac rehabilitation, with regard to delivery, effects on health outcomes, and equitable access. Development of cardiac rehabilitation in low-resource settings, and global efforts in control of non-communicable diseases will also be examined. Corequisite: HH/GH 2100 3.00 or HH/IHST 2100 3.00 or HH/KINE 2049 3.00 or HH/NURS 3515 3.00 Cross-listed to: HH/GH 4720 3.00, HH/NURS 4700 3.00 Course Credit Exclusions: HH/IHST 4720 3.00"
  },
  {
    "code": " The Canadian Health Care System",
    "name": "HH/NURS 4710 3.00",
    "description": "The components of the Canadian health care system; roles played by governments, professional organizations; contemporary issues of cost control; organization and delivery of health services. Prerequisite: For BScN students HH/NURS 3300 3.00 or HH/NURS 2700 6.00; for students in other programs AP/ADMS 2300 6.00 or equivalent or permission of the Instructor. Note: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Nurses as Teachers and Learners",
    "name": "HH/NURS 4720 3.00",
    "description": "Explores multiple theories and theoretical perspectives on teaching and learning within the context of nursing to promote health and healing from viewpoints of both teachers and learners. Opportunities for analysis and development of teaching/learning situations with critique and application of relevant theories and teaching/learning modalities to praxis. PRIOR TO WINTER 2012: course credit exclusions: HH/NURS 3720 3.00. Note 1: Open only to students in the BScN program. Note 2: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Child Rights and Child/Youth Centredness in Canadian Nursing",
    "name": "HH/NURS 4760 3.00",
    "description": "Enables nurses to develop a model of nursing practice which values child rights and which partners with children and youth. Child/youth centred nursing is explained within the context of children\u0027s lived experiences, Canadian nursing ethics and child rights. Note 1: Open only to students in the BScN program or for other students with permission of the undergraduate director. Note 2: Fieldwork is required. Note 3: A minimum grade of 5.00 (C+) is required in this course for the BScN degree. Previously offered as: HH/NURS 3760 3.00."
  },
  {
    "code": " Directed Reading",
    "name": "HH/NURS 4800 3.00",
    "description": "An independent reading course in which students select one or two areas for extensive reading and writing. Specific areas are to be selected in consultation with an appropriate faculty member. Prerequisites: 78 credits including HH/NURS 2700 6.00, HH/NURS 4710 3.00 and HH/NURS 4750 3.00, and permission of the undergraduate director. Open only to Nursing majors. Note 1: Students must be accepted by a faculty supervisor before they can register in this course. The course transaction form for such a course must be submitted with a note from the supervisor stating his or her willingness to perform this task. Permission of the undergraduate director is also required. Note 2: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Directed Reading",
    "name": "HH/NURS 4800 6.00",
    "description": "An independent reading course in which students select one or two areas for extensive reading and writing. Specific areas are to be selected in consultation with an appropriate faculty member. Prerequisites: 78 credits including HH/NURS 2700 6.00, HH/NURS 4710 3.00 and HH/NURS 4750 3.00, and permission of the undergraduate director. Open only to Nursing majors. Note 1: Students must be accepted by a faculty supervisor before they can register in this course. The course transaction form for such a course must be submitted with a note from the supervisor stating his or her willingness to perform this task. Permission of the undergraduate director is also required. Note 2: A minimum grade of 5.00 (C+) is required in this course for the BScN degree."
  },
  {
    "code": " Swimming I",
    "name": "HH/PKIN 0200 0.00",
    "description": "An introduction to the fundamentals of stroke technique for front crawl, back crawl, elementary backstroke, breast-stroke and sidestroke. Non-swimmers are encouraged to enrol as this course will focus on deep water skills and safety requirements. Note: Students who have completed at least one of the following, the Canadian Red Cross Swim Kids 10 or AquaQuest 12; the Toronto Learn to Swim Ultra 9; the YMCA of Canada Star 6; or the Lifesaving Society of Canada Learn to Swim Level 6, should take HH/PKIN 0270 0.00, HH/PKIN 0285 0.00 or HH/PKIN 0294 0.00 instead."
  },
  {
    "code": " Lifesaving",
    "name": "HH/PKIN 0240 0.00",
    "description": "A lifesaving course which provides students with water skills associated with self-rescue and techniques for rescuing others safely. Assessment and first aid skills for emergencies in aquatic settings are included. Upon successful completion of certification standards students are eligible to receive: The Lifesaving Society Bronze Star, Bronze Medallion and Bronze Cross. Prerequisites: HH/PKIN 0200 0.00, or Canadian Red Cross Swim Kids 10 or AquaQuest 12, or Toronto Learn to Swim Ultra 9, or YMCA Star 6, or Lifesaving Society Level 6, or by permission of the Instructor."
  },
  {
    "code": " Aqua Fitness (Deep Water)",
    "name": "HH/PKIN 0285 0.00",
    "description": "Provides students with fitness activities and teaching techniques in a deep water aquatic environment. Students can opt to take WaterArt teacher certification. All classes will include theory and practical activities which are low- to non-weight bearing. Prerequisite: HH/PKIN 2000 2.00 or equivalent."
  },
  {
    "code": " Sports Conditioning in an Aquatic Environment",
    "name": "HH/PKIN 0286 0.00",
    "description": "Focuses on training techniques in a deep water aquatic environment such as resistance training, increased flexibility through buoyancy, cardiovascular enhancement and endurance. Core stabilization is greatly intensified by working vertically in the water. Lessened impact on the joints helps to prevent injuries or assists in healing them. Prerequisite: HH/PKIN 0200 0.00 or equivalent. Note: There is an additional option for certification as a WaterArt Sports Conditioning Specialist. Equivalency for this course is the Canadian Red Cross Swim Kids 10 or AquaQuest 12; the Toronto Learn to Swim Ultra 9; the YMCA of Canada Star 6; or the Lifesaving Society of Canada Learn to Swim Level 6."
  },
  {
    "code": " Aquatic Games",
    "name": "HH/PKIN 0294 0.00",
    "description": "Focuses on aquatic activities featuring competitive sports and cooperative exercises. The range of involvement spans exercises for team building to competitive team and one on one competition. Prerequisite: HH/PKIN 2000 2.00 or equivalent."
  },
  {
    "code": " Pre-Swim I",
    "name": "HH/PKIN 0295 0.00",
    "description": "Designed for non-swimmers, particularly those with no previous aquatic learning. It is also suitable for those who may have a fear of water. Prerequisite: permission of the Instructor."
  },
  {
    "code": " Men\u0027s Basketball I",
    "name": "HH/PKIN 0302 0.00",
    "description": "For more details including a course description, please consult the Kinesiology and Health Science supplemental calendar."
  },
  {
    "code": " Women\u0027s Basketball I",
    "name": "HH/PKIN 0303 0.00",
    "description": "For more details including a course description, please consult the Kinesiology and Health Science supplemental calendar."
  },
  {
    "code": " Football I",
    "name": "HH/PKIN 0308 0.00",
    "description": "Introduces the student to the basic skills involved in the various positions of a football team."
  },
  {
    "code": " Hockey I",
    "name": "HH/PKIN 0312 0.00",
    "description": "Teaches each student the fundamental skills of ice hockey. Canadian Hockey Association Coaching Certification may be granted with successful completion of this course."
  },
  {
    "code": " Soccer I",
    "name": "HH/PKIN 0328 0.00",
    "description": "Provides opportunities for practice and instruction in the basic skills of soccer including knowledge and understanding of offensive and defensive principles used in game situations."
  },
  {
    "code": " Futsal (indoor soccer)",
    "name": "HH/PKIN 0330 0.00",
    "description": "Provides instruction on the basic soccer skills that are required to play the contemporary indoor soccer game Soccer Futsal. Team competitions, rules of the game, and the theory and history of Soccer Futsal will also be covered."
  },
  {
    "code": " Volleyball I",
    "name": "HH/PKIN 0332 0.00",
    "description": "Introduces students to basic skills and concepts in volleyball. Particular emphasis is placed on passing skills and basic volleyball play. Limited involvement as a minor official in a volleyball event is utilized to develop an understanding of rules and match protocol."
  },
  {
    "code": " Volleyball II",
    "name": "HH/PKIN 0333 0.00",
    "description": "This course reviews and develops basic skills of the game emphasizing a coaching perspective, and develops an understanding of offensive and defensive team play and various team tactics. Limited involvement as a minor official in a volleyball event is utilized in the course pedagogy. Prerequisite: HH/PKIN 0332 0.00."
  },
  {
    "code": " Softball",
    "name": "HH/PKIN 0340 0.00",
    "description": "A skills-based and participation-based course in which the basic skills of throwing, batting, fielding, team play and offence are emphasized. Short games are a daily component of the class."
  },
  {
    "code": " Team Handball I",
    "name": "HH/PKIN 0350 0.00",
    "description": "For more details including a course description, please consult the Kinesiology and Health Science supplemental calendar."
  },
  {
    "code": " Frisbee Sports: Competitive \u0026 Cooperative Disc Sports",
    "name": "HH/PKIN 0370 0.00",
    "description": "Features skills development, competitive sports and cooperative games in team and individual formats for disc sports."
  },
  {
    "code": " Basic Team Sport Skills",
    "name": "HH/PKIN 0390 0.00",
    "description": "Introduces students to basic motor/movement skills and drills in order to progress to team sports. Students will develop knowledge and confidence n their basic motor skills allowing for a smoother transition into team sport practica."
  },
  {
    "code": " Games Through the Ages",
    "name": "HH/PKIN 0392 0.00",
    "description": "Students will learn skills, rules and tactics of games through the ages such as Earthball, Tlachi, Indian Kickball and Quidditch. This course is for students who are interested in learning to play active, creative and competitive games through fun, theatrics and physicality."
  },
  {
    "code": " Tai Chi I",
    "name": "HH/PKIN 0400 0.00",
    "description": "Comprises practical and theoretical study of Chinese traditional therapeutic Qi-Gong (twenty-posture) and an Essential Tai-Chi training routine. Included are the role of moral character in martial arts training and professional Tai-Chi training techniques."
  },
  {
    "code": " Yoga I",
    "name": "HH/PKIN 0402 0.00",
    "description": "An introduction to the principles and skills of posture, movement and breath in Hatha Yoga."
  },
  {
    "code": " Pilates: Restorative",
    "name": "HH/PKIN 0403 0.00",
    "description": "This course explores and analyzes deep (body core) movements for stability and mobility. Students experience and develop skills in assessing and correcting alignment issues and common muscle imbalances utilizing principles of movement coupled with an understanding of skeletal alignment. The course focuses on injury prevention and recovery. Course credit exclusion: HH/ PKIN 0408 0.00"
  },
  {
    "code": " Aikido Yoshinkan",
    "name": "HH/PKIN 0404 0.00",
    "description": "An introduction to basic movements of Aikido Yoshinkan from which all techniques evolve. The techniques for the first two levels are taught as well as backward and forward rolls."
  },
  {
    "code": " Pilates",
    "name": "HH/PKIN 0405 0.00",
    "description": "Offers a comprehensive overview of Joseph Pilates\u0027 work, and training in the proper execution of Pilates mat exercises. Students will develop an appreciation of the potential for Pilates to benefit special populations (i.e. athletes, seniors, dancers, etc.) and for the prevention and rehabilitation of injuries."
  },
  {
    "code": " Kung-Fu",
    "name": "HH/PKIN 0406 0.00",
    "description": "Introduces traditional Northern Shao-Lin Kung-Fu which has a long and rich history in China. The course focuses on basic drills and applied techniques with controlled sparring. The course concludes with a short weapon routine - Flying Rainbow Kung-Fu fan which combines all basic skills into a sequence of moves."
  },
  {
    "code": " Self-Defense",
    "name": "HH/PKIN 0407 0.00",
    "description": "This practicum course trains students in awareness, tactical communication and effective self-defense techniques."
  },
  {
    "code": " Court Games",
    "name": "HH/PKIN 0415 0.00",
    "description": "Introductory and intermediate level of skills and play for racquetball and squash. The focus is on the development of squash skills and strategies of play."
  },
  {
    "code": " Tennis I",
    "name": "HH/PKIN 0435 0.00",
    "description": "Introductory and intermediate level course covering techniques for basic strokes, tactics and strategies for singles and doubles. Theory component covers rules and general knowledge of the sport."
  },
  {
    "code": " Badminton I",
    "name": "HH/PKIN 0440 0.00",
    "description": "Teaches introductory and intermediate level of basic skills and play. Emphasis is on developing correct technique and strategies for singles and doubles."
  },
  {
    "code": " Strength Training",
    "name": "HH/PKIN 0460 0.00",
    "description": "Introduces strength training techniques and methods and teaches the principles of maximum strength training, maximum endurance training, a combination of strength and endurance training, power training, and circuit training."
  },
  {
    "code": " Basic Movement",
    "name": "HH/PKIN 0500 0.00",
    "description": "Introduces integrated movements, concepts and philosophies from Eastern and Western traditions: Dance (Jazz and Modern), Martial Arts (Tai Chi, Tae Kwon Do, Aikido) and Healing Movement (Yoga) are explored."
  },
  {
    "code": " Men\u0027s Gymnastics I",
    "name": "HH/PKIN 0502 0.00",
    "description": "An introductory course with a recreation/educational base that teaches basic movements and movement patterns characteristic of gymnastics, the utilization of various types of gymnastics equipment and covers the fundamentals of safety and liability."
  },
  {
    "code": " Women\u0027s Gymnastics I",
    "name": "HH/PKIN 0503 0.00",
    "description": "An introductory course with a recreation/educational base that teaches basic movements and movement patterns characteristic of gymnastics, the utilization of various types of gymnastics equipment and covers the fundamentals of safety and liability."
  },
  {
    "code": " Modern Dance I",
    "name": "HH/PKIN 0560 0.00",
    "description": "An introduction to the basic technique of the Limon style and the principles of modern dance choreography."
  },
  {
    "code": " Dance in Movies and Videos of Popular Culture",
    "name": "HH/PKIN 0562 0.00",
    "description": "Focuses on learning how to dance in formations done in iconic movies and music videos, from the most recent, to the favourites of years gone by. Students will work together to recreate dances that have dominated popular culture and appeared in movies and on television over the past 70 years. This course will incorporate many different dance styles."
  },
  {
    "code": " Ballroom Dance I",
    "name": "HH/PKIN 0570 0.00",
    "description": "Introduces ballroom dance providing experience with different forms of American style ballroom dance. Emphasis is placed on the use of basic ballroom dance steps, combinations, and dances, and how they relate to music. At least four different ballroom dances are taught. Select dances from the following are covered: Waltz, Foxtrot, Tango, Cha Cha, Rumba, Swing, Bolero, and Mambo."
  },
  {
    "code": " Ballroom Dance II",
    "name": "HH/PKIN 0575 0.00",
    "description": "Designed to expand upon steps, dances, and style characteristics learned in HH/PKIN 0570 0.00. Students learn more advanced American style ballroom steps, combinations, dances, and partnering work, as well as Latin social dances. Select dances from the following are taught: Waltz, Foxtrot, Tango, Cha Cha, Rumba, Swing, Bolero, Mambo, Salsa, and Samba. Prerequisite: HH/PKIN 0570 0.00."
  },
  {
    "code": " Country Dance",
    "name": "HH/PKIN 0585 0.00",
    "description": "Places emphasis on teaching and learning basic Country Dance fundamentals including steps, positions, patterns, rhythms and styles."
  },
  {
    "code": " Jazz Dance I",
    "name": "HH/PKIN 0590 0.00",
    "description": "An introduction to jazz rhythm, musical phrasing, and physical fundamental movements."
  },
  {
    "code": " Track and Field I",
    "name": "HH/PKIN 0600 0.00",
    "description": "An introduction to track and field. Emphasis on developing motor skills and strength necessary to perform basic track and field movements. Fitness will be stressed along with an introduction to the teaching progressions and skill development in specific track events."
  },
  {
    "code": " Emergency Care I",
    "name": "HH/PKIN 0750 0.00",
    "description": "An introduction to the care given to a suddenly injured or ill person in order to sustain life and prevent further injury. Upon successful completion, students will be certified in Basic Rescuer C.P.R. - C and Standard First Aid. Note: Normally only open to fourth-year students. All Kinesiology and Health Science students are required to complete HH/PKIN 0750 0.00, or equivalent. Equivalency is current CPR Basic Rescuer Certificate (Level C) and a Standard First Aid Certificate."
  },
  {
    "code": " Advanced First Aid/CPR",
    "name": "HH/PKIN 0751 0.00",
    "description": "This course builds on the theory and skills introduced in HH/PKIN 0750 0.00 and provides advanced theory and techniques to respond to a suddenly ill or injured person. This course also trains individuals to prevent further injury in a variety of settings. Students may be certified with Automatic External Defibrillation, Airway Management, CPR-Health Care Professional level, and Advanced First Aid Provider. Prerequisite: HH/PKIN 0750.00 or Standard First Aid or Cardio Pulmonary Resuscitation (CPR) current within last two years."
  },
  {
    "code": " First Responder for Athletic Therapy I",
    "name": "HH/PKIN 0761 0.00",
    "description": "This course is designed, in combination with HH/PKIN 0762 0.00, to satisfy the requirements of the Canadian Red Cross First Responder course within a sports medicine format. The course will include asynchronous online lectures, in-person hands on and scenario-based practice labs as well as on-campus observational experiences with varsity athletes. Students will receive theoretical information, specifics on applying first responder skills in practical sports medicine situations and have the opportunity to participate in practice scenarios to reinforce the learning process. This course is required for the Athletic Therapy Certificate Program."
  },
  {
    "code": " First Responder for Athletic Therapy II",
    "name": "HH/PKIN 0762 0.00",
    "description": "This course is designed, in combination with HH/PKIN 0761 0.00, to satisfy the requirements of the Canadian Cross First Responder course within a sports medicine format. The course will include asynchronous online lectures, in-person hands on and scenario-based practice labs as well as on-campus observational experiences with varsity athletes. Students will receive theoretical information, specifics on applying first responder skills in practical sports medicine situations and have the opportunity to participate in practice scenarios to reinforce the learning process. This course required for the Athletic Therapy Certificate Program."
  },
  {
    "code": " First Aid/CPR Instructor",
    "name": "HH/PKIN 0770 0.00",
    "description": "This course focuses on theoretical and practical teaching techniques of First Aid/CPR. Upon successful completion, students may be certified as First Aid/CPR Instructors. Prerequisite: HH/PKIN 0750 0.00 or equivalent."
  },
  {
    "code": " Clinical Placement in Athletic Therapy I",
    "name": "HH/PKIN 0811 0.00",
    "description": "This experiential education is designed for students who are in their second year in the Athletic Therapy Certificate Program. Students will be assigned to designated on or off-campus practicums. Students will be involved in a hands-on experience as they are introduced to the clinical and field aspects of athletic therapy. This course includes practicum opportunities and online learning activities. They will work alongside other athletic therapy students under the direct supervision of Certified Athletic Therapists. Students will attend varsity practices, games and clinic shifts. These aspects will be scheduled with consideration for student academic schedules. This course is required for the Athletic Therapy Certificate Program."
  },
  {
    "code": " Practicum in Athletic Therapy II",
    "name": "HH/PKIN 0812 0.00",
    "description": "This experiential education course is designed for students who are in their second year in the Athletic Therapy Certificate program. Placements will be provided with students engaged both on and off campus. Students will transition to work more independently completing clinical and field skills. They will work under the direction of Certified Athletic Therapists or Sport Physiotherapists to gain clinical and field knowledge and skills. Students will attend varsity practices, games and clinic shifts. These aspects will be scheduled with consideration for student academic schedules. This course is required for the Athletic Therapy Certificate Program."
  },
  {
    "code": " Elementary and Recreational Games",
    "name": "HH/PKIN 0840 0.00",
    "description": "This course develops an understanding and appreciation of the role of play and games for children; an understanding of the structure, process and outcomes of play and games as they impact upon the individual; students acquire practical leadership skills in planning, implementation and evaluation of play and games for children."
  },
  {
    "code": " Personal Training I",
    "name": "HH/PKIN 0861 0.00",
    "description": "Provides students with the background and personal experience required for prescribing and directing a personal training regimen. Participants are required to plan and engage in an extensive personal training program both in, and out of, class. Prerequisite: Only open to students in the Fitness Certificate Stream who are enrolled in or have completed HH/KINE 4400 6.00. Corequisite: HH/PKIN 0862 0.00. Open to: Only students concurrently enrolled in HH/PKIN 0862 0.00. Note: Students must successfully complete both HH/PKIN 0861 0.00 and HH/PKIN 0862 0.00."
  },
  {
    "code": " Personal Training II",
    "name": "HH/PKIN 0862 0.00",
    "description": "Builds on the principles and learning objectives of HH/PKIN 0861 0.00. Prerequisite: Only open to students in the Fitness Certificate Stream who are enrolled in or have completed HH/KINE 4400 6.00. Corequisite: HH/PKIN 0861 0.00. Open to: Only students concurrently enrolled in HH/PKIN 0861 0.00. Note: Students must successfully complete both HH/PKIN 0861 0.00 and HH/PKIN 0862 0.00."
  },
  {
    "code": " Introduction to Psychology",
    "name": "HH/PSYC 1010 6.00",
    "description": "A survey of psychology introducing basic terms, concepts and methods. Included are topics such as biological bases of behaviour, learning, perception, motivation, cognition, child development, personality, and abnormal and social psychology. Note: This course is required for all students who intend to pursue additional HH/PSYC courses the 2000-, 3000- and 4000- levels. Students must pass the course with a minimum grade of C in order to pursue further studies in psychology. Course credit exclusion: GL/PSYC 2510 6.00."
  },
  {
    "code": " Writing in Psychology",
    "name": "HH/PSYC 2010 3.00",
    "description": "Develop university-level writing ability. Students write about psychological content; however, this course develops general written communication skills that are broadly transferable. Students learn how texts \u0027work\u0027 and develop self-reflective writing skill. This course builds skills for writing in upper year University courses and develops the literacy expected of an educated citizen. Prerequisite: HH/PSYC 1010 6.00 with a minimum grade of C. Not open to: Non Psychology majors."
  },
  {
    "code": " Statistical Methods I and II",
    "name": "HH/PSYC 2020 6.00",
    "description": "An introduction to the analysis of data from psychological studies. Fundamental concepts and techniques of both descriptive and inferential statistics and their application to psychological research. Prerequisite or corequisite: HH/PSYC 1010 6.00, with a minimum grade of C when used as a prerequisite. Course credit exclusions: AP/SOCI 3030 6.00, HH/PSYC 2021 3.00, HH/PSYC 2022 3.00, SC/BIOL 2060 3.00, HH/KINE 2050 3.00, HH/KINE 3150 3.00, SC/MATH 2500 3.00, SC/MATH 2560 3.00, SC/MATH 2565 3.00, SC/MATH 2570 3.0, GL/PSYC 2530 3.00, GL/PSYC 2531 3.00. Note 1: The course credit exclusions listed above may not be substituted for HH/PSYC 2020 6.00 to satisfy psychology degree requirements unless approved as acceptable substitutes by the department and Faculty. Please consult the relevant department and Faculty for more information. Note 2: Students who discontinue registration in HH/PSYC 2020 6.00 after the fall term may not petition for credit for a half course in statistics."
  },
  {
    "code": " Statistical Methods I",
    "name": "HH/PSYC 2021 3.00",
    "description": "The fundamental concepts and application of descriptive statistics. An introduction to probability and inferential statistics, including hypothesis testing with the normal- and t-distributions. Prerequisite or corequisite: HH/PSYC 1010 6.00, GL/PSYC 2510 6.00, with a minimum grade of C when used as a prerequisite. Course credit exclusions: HH/PSYC 2020 6.00, SC/BIOL 2060 3.00, HH/KINE 2050 3.00, SC/MATH 2500 3.00, SC/MATH 2560 3.00."
  },
  {
    "code": " Statistical Methods II",
    "name": "HH/PSYC 2022 3.00",
    "description": "A continuation of the study of fundamental concepts and techniques of descriptive and inferential statistics. Topics include correlation, regression, analysis of variance and non-parametric statistics. Prerequisite: One of HH/PSYC 2021 3.00, HH/KINE 2050 3.00, SC/MATH 2560 3.00. Prerequisite or corequisite: HH/PSYC 1010 6.00, GL/PSYC 2510 6.00, with a minimum grade of C when used as a prerequisite. Course credit exclusions: HH/PSYC 2020 6.00, HH/KINE 3150 3.00, SC/MATH 2570 3.00, GL/PSYC 2531 3.00."
  },
  {
    "code": " Introduction to Research Methods",
    "name": "HH/PSYC 2030 3.00",
    "description": "An introduction to the use of experimental and non-experimental research methods by psychologists in the study of behaviour. Topics such as research design, external and internal validity, sources of bias, APA style and ethics are considered. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C. Course credit exclusions: HH/KINE 2049 3.00, GL/PSYC 2520 3.00. NCR: students who have passed or are taking HH/PSYC 3010 3.00."
  },
  {
    "code": " Developmental Psychology",
    "name": "HH/PSYC 2110 3.00",
    "description": "This course considers physical, intellectual, emotional and social development from birth through adolescence and the impact of the interaction of these various aspects of development upon the individual as a whole. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C. Course credit exclusions: GL/PSYC 3300 3.00."
  },
  {
    "code": " Social Psychology",
    "name": "HH/PSYC 2120 3.00",
    "description": "This course reviews the theories, methods and empirical evidence in the scientific study of human social behaviour. The aim is to elucidate social psychological processes through the examination of areas such as social influence, attribution, attitudes and stereotyping. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C. Course credit exclusions: GL/PSYC 3660 3.00."
  },
  {
    "code": " Personality",
    "name": "HH/PSYC 2130 3.00",
    "description": "Examines major theories and research on personality functioning, with a focus on description of the factors contributing to the development, structure and dynamics of personality. Prerequisite: HH/PSYC 1010 6.00 with a minimum grade of C. Course credit exclusion: GL/PSYC 3220 3.00."
  },
  {
    "code": " Sensation and Perception I",
    "name": "HH/PSYC 2220 3.00",
    "description": "A course in problems, experimental methods and research findings in sensation and perception. Vision and hearing are covered in some detail, including discussion of the structure and function of the eye and ear, and cortical areas responsible for processing visual and auditory information. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C. Course credit exclusions: GL/PSYC 3690 3.00."
  },
  {
    "code": " Motivation",
    "name": "HH/PSYC 2230 3.00",
    "description": "A course in problems, experimental methods and research findings in motivation. Topics include emotion, drives and social motives. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C. Course credit exclusion: GL/PSYC 3380 3.00."
  },
  {
    "code": " Biological Basis of Behaviour",
    "name": "HH/PSYC 2240 3.00",
    "description": "An introduction to fundamental principles of brain function and neural organization, as illustrated by classic findings and current research. Topics may include sleep and dreaming, memory, sensory motor processing, motivation (e.g. eating, reproductive behaviours), higher cognitive processes and neurological disorders. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C. Course credit exclusion: GL/PSYC 3670 3.00."
  },
  {
    "code": " Cognition",
    "name": "HH/PSYC 2260 3.00",
    "description": "A survey of higher-order cognitive processes in humans. Topics include attention, memory, problem solving, thinking and language. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C. Course credit exclusion: GL/PSYC 3370 3.00. Previously offered as: HH/PSYC 3260 3.00."
  },
  {
    "code": " Professionalism and Communication in Psychology",
    "name": "HH/PSYC 3000 3.00",
    "description": "Enhance students\u0027 professionalism and communication skills through teaching, class discussion, assignments and experiential learning within practicum settings. Specific learning objectives include: capacity for autonomous learning, the development of an identity as an academic psychologist, development of professional integrity, professional self-presentation, and effective communication of academic work in various forms (e.g. posters, talks, written academic papers, fellowship applications). Prerequisites: HH/PSYC 1010 6.00 with a minimum grade of C, HH/PSYC 2030 3.00, HH/PSYC 2020 6.00, HH/PSYC 2010 3.00. Open to: Specialized Honours Students. Note: Enrolment is by permission of the department"
  },
  {
    "code": " Intermediate Research Methods",
    "name": "HH/PSYC 3010 3.00",
    "description": "An intermediate course to provide further experience with the design, execution, analysis, interpretation and communication of psychological studies. Building on the foundation established in HH/ PSYC 2030 3.00, the course further prepares students for many types of advanced-research and Honours thesis projects. Prerequisites: HH/PSYC 1010 6.00 with a minimum grade of C, HH/PSYC 2030 3.00, one of HH/PSYC 2020 6.00 or HH/PSYC 2021 3.00 and HH/PSYC 2022 3.00. Course credit exclusion: GL/PSYC 3525 3.00. Open to: Specialized Honours Students. Note: Open to Honours Students by permission of the Department."
  },
  {
    "code": " Introduction to Program Evaluation",
    "name": "HH/PSYC 3015 3.00",
    "description": "Explores the systematic collection of information to assess the design, implementation, or outcomes of a program in order to demonstrate program effectiveness, identify areas for improvement, and/or inform future program development. This course is designed for undergraduate students interested in learning the essentials of program evaluation theory and its application in psychology across different settings (e.g., schools, hospitals, community, industry). Prerequisites: HH/PSYC 1010 6.00 with a minimum grade of C, HH/PSYC 2010 3.00, HH/PSYC 2020 6.00 or HH/PSYC 2021 3.00 and HH/PSYC 2022 3.00, HH/PSYC 2030 3.00 Open to: Psychology students who have successfully completed a total of 54 credits"
  },
  {
    "code": " Intermediate Statistics I",
    "name": "HH/PSYC 3031 3.00",
    "description": "This course provides students with the opportunity to apply, consolidate, and extend their statistical analysis skills to realistic psychological data using methods such as regression analysis. An important component of the course is the use of a statistical software package such as SPSS or SAS to prepare students for independent thesis research. An important component of the course is the use of a statistical software package to prepare students for independent thesis research or other research-related work. Prerequisites: HH/PSYC 1010 6.00 with a minimum grade of C, HH/PSYC 2030 3.00, one of HH/ PSYC 2020 6.00 or HH/PSYC 2021 3.00 and HH/PSYC 2022 3.00. Open to: All psychology students meeting the prerequisites, or by permission of the Department of Psychology."
  },
  {
    "code": " Intermediate Statistics II",
    "name": "HH/PSYC 3032 3.00",
    "description": "Topics include data preparation and visualization, analyses with missing data, intermediate general linear models, robust statistics, and communicating statistical results. In addition, the students will also be trained in statistical software (e.g., R) for analyzing data. Prerequisites: HH/PSYC 1010 6.00 with minimum grade of C, HH/PSYC 2020 6.00 or equivalent, HH/PSYC 2030 3.00, HH/PSYC 3031 3.00"
  },
  {
    "code": " Psychological Measurement",
    "name": "HH/PSYC 3090 3.00",
    "description": "An introduction to measurement theory, including principles of psychological testing with special emphasis on test construction and the statistical evaluation, interpretation and validation of test scores. The course does not address the applied uses of tests. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; one of HH/PSYC 2020 6.00, HH/PSYC 2021 3.00. Course credit exclusion: GL/PSYC 3550 3.00."
  },
  {
    "code": " History of Psychology",
    "name": "HH/PSYC 3125 3.00",
    "description": "Examines the discipline of psychology from a historical perspective and studies the emergence and development (and sometimes decline) of a number of theoretical systems that have influenced the nature, content and direction of psychological inquiry. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C. Course credit exclusion: GL/PSYC 3650 3.00."
  },
  {
    "code": " Abnormal Psychology",
    "name": "HH/PSYC 3140 3.00",
    "description": "A course on the nature, causes and treatment of a number of behaviour disorders. Topics include developmental disorders, anxiety problems, personality disorders, substance abuse, affective disorders, organic brain disorders and schizophrenia. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C. Course credit exclusion: GL/PSYC 3230 3.00."
  },
  {
    "code": " Health Psychology",
    "name": "HH/PSYC 3170 3.00",
    "description": "Explores the developing role of psychology in the health field. It provides psychological frameworks that elucidate the (non) practice of health behaviours, the role of stress in illness, adjustment to and coping with illness and representations of health/illness. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C. Course credit exclusions: HH/KINE 3100 3.00, HH/KINE 4710 3.00, GL/PSYC 3635 3.00."
  },
  {
    "code": " Neural Basis of Behaviour",
    "name": "HH/PSYC 3250 3.00",
    "description": "This course surveys issues concerning the development and localization of cerebral functions, and examines experimental and clinical studies illustrating behavioural effects of brain damage. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2240 3.00 or HH/NRSC 2100 3.00 or SC/NRSC 2100 3.00"
  },
  {
    "code": " The Psychology of Reasoning, Judgment and Decision-Making",
    "name": "HH/PSYC 3255 3.00",
    "description": "Examines the psychology of human reasoning, judgment and decision-making. Discuss current theories that shape the field, including dual process models and The Great Rationality Debate. Topics include: classic reasoning theories, the heuristics and biases tradition, individual differences in performance, overconfidence paradigms, prospect theory, neural bases, developmental studies, clinical applications, studies in behavioural economics and training effects. Prerequisites: HH/PSYC 1010 6.00 with a minimum grade of C; HH/PSYCH 2260 3.00 or HH/PSYC 2110 3.00 or HH/PSYC 2120 3.00. Open to: Students who have completed at least 54 earned credits."
  },
  {
    "code": " Memory",
    "name": "HH/PSYC 3265 3.00",
    "description": "An examination of how humans encode, store and retrieve information from memory. Although the course focuses on data from laboratory studies and their theoretical interpretation, some consideration is given to applied aspects of human memory. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C. Course credit exclusion: GL/PSYC 3390 3.00."
  },
  {
    "code": " Sensation and Perception II",
    "name": "HH/PSYC 3270 3.00",
    "description": "A continuation of Sensation and Perception I. Senses such as balance, taste, smell and touch are considered, and there is more thorough discussion of the methods used to study sensory processing and perception. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2220 3.00. Course credit exclusion: GL/PSYC 3690 3.00."
  },
  {
    "code": " Psycholinguistics",
    "name": "HH/PSYC 3290 3.00",
    "description": "A survey of psycholinguistic research and theory. Topics chosen from the following: introduction to language structure, biological basis for language, speech perception, sentence processing, speech production, relation of language and thought, language acquisition and atypical language. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C, or AP/LING 1000 6.00. Course credit exclusions: HH/PSYC 3190 3.00, GL/PSYC 3640 3.00, GL/LIN 3640 3.00."
  },
  {
    "code": " Psychology and Law",
    "name": "HH/PSYC 3310 3.00",
    "description": "Examines the applications of psychology to legal issues and procedures. Drawing from the areas of social, cognitive, developmental and clinical psychology, the law\u0027s informal theories of human behaviour are compared to what psychologists know on the basis of theories and research. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C. Course credit exclusion: GL/PSYC 3600 3.00."
  },
  {
    "code": " Cultural Psychology",
    "name": "HH/PSYC 3350 3.00",
    "description": "This course addresses theory, research, and methods pertaining to culture and psychology. The course begins by offering different perspectives on culture and the methodological challenges that researchers face when bringing a cultural level of analysis to human behaviour. The potential role of culture is examined across a range of psychological areas including perception, cognition, emotion, developmental processes, as well as social and abnormal behaviour. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C. Note: This course does not count for science credit."
  },
  {
    "code": " Evolutionary Psychology",
    "name": "HH/PSYC 3420 3.00",
    "description": "The evolutionary origins of infra-human and human psychological processes and behaviour are considered from the perspective of the original Darwinian theory through to current sociobiological concepts. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C. Course credit exclusion: GL/PSYC 3680 3.00."
  },
  {
    "code": " Behaviour in Groups",
    "name": "HH/PSYC 3430 3.00",
    "description": "An examination of human behaviour in small group situations, with particular emphasis on sensitivity training, communication, interaction feedback processes, norms, group development and role theory. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C. Course credit exclusion: GL/PSYC 3662 3.00. Note: This course does not count for science credit."
  },
  {
    "code": " Psychology of Women",
    "name": "HH/PSYC 3480 3.00",
    "description": "Explores factors associated with the psychology of women, including gender-role stereotypes, socialization practices, male-female differences and the family. At all times, the interpretation offered is made with reference to the broader social context. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C."
  },
  {
    "code": " Adult Development and Aging",
    "name": "HH/PSYC 3490 3.00",
    "description": "An examination of data and theories relating to the psychology of adult development and aging. Major topics include biological and psychological theories of aging; age changes in intelligence, personality and social relations; pathologies of old age and methods of intervention. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C. Course credit exclusions: GL/PSYC 3310 3.00."
  },
  {
    "code": " Neuroscience of Aging \u0026 Cognitive Health",
    "name": "HH/PSYC 3495 3.00",
    "description": "This course investigates the neural basis of cognitive changes across the adult lifespan. Students will learn how the brain is altered in structure and function as people age and how these changes impact cognition. The course will examine the border between normal and abnormal aging and how neuroscience research is informing strategies to sustain cognitive health into older adulthood. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2240 3.00."
  },
  {
    "code": " Development in Adolescence",
    "name": "HH/PSYC 3500 3.00",
    "description": "This course involves the scientific study of changes in affective, social and cognitive development during the second decade of life. Focus is on fundamental developmental changes, the contexts in which development occurs and the central psychosocial issues of adolescence. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2110 3.00."
  },
  {
    "code": " Infancy",
    "name": "HH/PSYC 3520 3.00",
    "description": "This course involves the scientific study of changes in motor development, perception, and social and physical cognition that occur during the first two years of life. Focus is on the nature and determination of these changes and on theoretical and methodological advances. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2110 3.00."
  },
  {
    "code": " Creativity",
    "name": "HH/PSYC 3550 3.00",
    "description": "Offers a systematic study of the persons, processes and products of creativity, including theories, research and measurement methods. Creativity is defined as something that is both novel and significant. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C."
  },
  {
    "code": " Psychology of Death and Dying",
    "name": "HH/PSYC 3560 3.00",
    "description": "This course considers issues and topics in thanatology including sociocultural influences on our understanding of death, care of the dying and medical ethics. It examines research and theory in aging and illness, adjustment to life-threatening conditions and grief reactions. Prerequisite: AK/AS/HH/SC/PSYC 1010 6.00 or AK/HH/PSYC 2410 6.00, with a minimum grade of C. Course credit exclusions: AK/PSYC 3290 3.00 (before Summer 2002), AK/AS/HH/SC/PSYC 4250 3.00, AK/HH/NURS 4790B 3.00."
  },
  {
    "code": " Drugs and Behaviour",
    "name": "HH/PSYC 3590 3.00",
    "description": "A survey of various aspects of major licit and illicit drugs. Topics include historical changes in use/abuse, methods of administration, neurochemical actions, pharmacological effects, and theories of addiction as viewed from physiological, cognitive, learning and social-psychological perspectives. Prerequisite:HH/PSYC 1010 6.00 with a minimum grade of C."
  },
  {
    "code": " Psychology of Intimate Relationships",
    "name": "HH/PSYC 3640 3.00",
    "description": "Why do people want to be in relationships? How do people choose romantic partners? What predicts relationship satisfaction and stability? What is the role of sexuality in relationships? How can people become better romantic partners? These and other questions are examined from a variety of theoretical perspectives and across the lifespan. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2120 3.00; completed at least 54 earned credits."
  },
  {
    "code": " Psychology of Sexual Orientation",
    "name": "HH/PSYC 3670 3.00",
    "description": "Examines how psychology theorizes and researches sexual orientations. Numerous theoretical perspectives are discussed and empirical research is reviewed. Issues include development of sexual orientations, and attitudes towards those with minority sexual orientations and identity development. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C. Note: This course does not count for science credit."
  },
  {
    "code": " Individual Research Project",
    "name": "HH/PSYC 3900 3.00",
    "description": "Students arrange to complete an individual research project with a full-time faculty member in the Psychology Department, Faculty of Health. This course allows students to obtain first-hand research experience in a professors area of research expertise. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C, HH/PSYC 2010 3.00; one of HH/PSYC 2020 6.00 or HH/PSYC 2021 3.00 and HH/PSYC 2022 3.00. Open to: Students who have earned 54 credits in the Honours or Specialized Honours Programs in Psychology Note: Students may complete one 6.00 credit or two 3.00 credit Individual Research Project courses in each academic year, to a maximum of 12.00 credits in total (HH/PSYC 3900 series and HH/PSYC 4900 series combined). After securing a supervisor, students should consult the Department of Psychology for an application."
  },
  {
    "code": " Individual Research Project",
    "name": "HH/PSYC 3901 3.00",
    "description": "Students arrange to complete an individual research project with a full-time faculty member in the Psychology Department, Faculty of Health. This course allows students to obtain first-hand research experience in a professors area of research expertise. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C, HH/PSYC 2010 3.00; one of HH/PSYC 2020 6.00 or HH/PSYC 2021 3.00 and HH/PSYC 2022 3.00. Open to students with 54 earned credits in the Honours or Specialized Honours Programs in Psychology. Note: Students may complete one 6.00 credit or two 3.00 credit Individual Research Project courses in each academic year, to a maximum of 12.00 credits in total (HH/PSYC 3900 series and HH/PSYC 4900 series combined). After securing a supervisor, students should consult the Department of Psychology for an application."
  },
  {
    "code": " Individual Research Project",
    "name": "HH/PSYC 3902 6.00",
    "description": "Students arrange to complete an individual research project with a full-time faculty member in the Psychology Department, Faculty of Health. This course allows students to obtain first-hand research experience in a professors area of research expertise. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C, HH/PSYC 2010 3.00; one of HH/PSYC 2020 6.00 or HH/PSYC 2021 3.00 and HH/PSYC 2022 3.00. Note: Students may complete one 6.00 credit or two 3.00 credit Individual Research Project courses in each academic year, to a maximum of 12.00 credits in total (HH/PSYC 3900 series and HH/PSYC 4900 series combined). After securing a supervisor, students should consult the Department of Psychology for an application. Open to: students with 54 earned credits in the Honours or Specialized"
  },
  {
    "code": " Individual Research Project",
    "name": "HH/PSYC 3903 6.00",
    "description": "Students arrange to complete an individual research project with a full-time faculty member in the Psychology Department, Faculty of Health. This course allows students to obtain first-hand research experience in a professors area of research expertise. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C, HH/PSYC 2010 3.00; one of HH/PSYC 2020 6.00 or HH/PSYC 2021 3.00 and HH/PSYC 2022 3.00. Open to: students with 54 earned credits in the Honours or Specialized Honours Programs in Psychology. Note: Students may complete one 6.00 credit or two 3.00 credit Individual Research Project courses in each academic year, to a maximum of 12.00 credits in total (HH/PSYC 3900 series and HH/PSYC 4900 series combined). After securing a supervisor, students should consult the Department of Psychology for an application."
  },
  {
    "code": " Specialized Honours Thesis",
    "name": "HH/PSYC 4001 6.00",
    "description": "Students carry out an individual piece of psychological research in consultation with a thesis supervisor and write a thesis. Some Honours thesis topics may not be eligible for science (SC) credit. In addition, students attend a seminar course. Prerequisite: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00 and HH/PSYC 2022 3.00 or HH/PSYC 2020 6.00; HH/PSYC 2010 3.00; HH/PSYC 3000 3.00; HH/PSYC 3010; HH/PSYC 3031 3.00. Course Credit Exclusion(s): GL/PSYC 4000 6.00, HH/PSYC 4000 6.00, HH/PSYC 4175 6.00, HH/PSYC 4180 6.00. Open to: Students in the Specialized Honours program who have completed at least 84 credits (excluding ED/EDUC courses). Note: This course is available to those students who applied to and were accepted into the specialized honours program. This course is not available for registration until the student completes the Specialized Honours Thesis Agreement form with the supervisor and submits the form to the Psychology Undergraduate Office."
  },
  {
    "code": " Seminar in Developmental Psychology",
    "name": "HH/PSYC 4010 3.00",
    "description": "Some major modern theories of child development are compared and their corresponding data and methodologies are analyzed. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HH/PSYC 2020 6.00; HH/PSYC 2110 3.00. Course credit exclusions: HH/PSYC 4010 6.00, GL/PSYC 4510 3.00"
  },
  {
    "code": " Seminar in Developmental Psychology",
    "name": "HH/PSYC 4010 6.00",
    "description": "Some major modern theories of child development are compared and their corresponding data and methodologies are analyzed. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HH/PSYC 2020 6.00; HH/PSYC 2110 3.00. Course credit exclusions: HH/PSYC 4010 3.00, GL/PSYC 4510 3.00."
  },
  {
    "code": " Seminar in Social Psychology",
    "name": "HH/PSYC 4020 3.00",
    "description": "In depth consideration of contemporary issues in social psychology. The focus will vary depending on the speciality area of the Instructor. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HH/PSYC 2020 6.00; HH/PSYC 2120 3.00. Course credit exclusion: HH/PSYC 4020 6.00."
  },
  {
    "code": " Seminar in Social Psychology",
    "name": "HH/PSYC 4020 6.00",
    "description": "In depth consideration of contemporary issues in social psychology. The focus will vary depending on the speciality area of the Instructor. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HH/PSYC 2020 6.00; HH/PSYC 2120 3.00. Course credit exclusion: HH/PSYC 4020 3.00."
  },
  {
    "code": " Behaviour Modification and Behaviour Therapy",
    "name": "HH/PSYC 4030 6.00",
    "description": "An examination of theoretical issues, basic research and practical application in the area of behaviour change. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HHPSYC 2020 6.00; HH/PSYC 2130 3.00;HH/PSYC 3140 3.00"
  },
  {
    "code": " Personality Theory and Behaviour Disorders",
    "name": "HH/PSYC 4050 6.00",
    "description": "A critical review of current concepts of the nature, causes and amelioration of disordered behaviour. Concepts are illustrated with selected examples of both normal and abnormal social behaviour. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HH/PSYC 2020 6.00; HH/PSYC 2130 3.00; HH/PSYC 3140 3.00."
  },
  {
    "code": " Counselling Psychology",
    "name": "HH/PSYC 4060 6.00",
    "description": "An examination of current theory, practice and research in counselling. Theories of counselling and psychotherapy are considered in relation to the process of psychological change in various settings. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HH/PSYC 2020 6.00; HH/PSYC 2130 3.00;HH/PSYC 3140 3.00. Course credit exclusions: HH/PSYC 4061 3.00, HH/PSYC 4062 3.00, GL/PSYC 4250 3.00."
  },
  {
    "code": " Theoretical Approaches to Counselling and Psychotherapy",
    "name": "HH/PSYC 4061 3.00",
    "description": "A survey of current psychotherapies including psychoanalytic, humanistic and behaviour therapies. Emphasis is on the theoretical assumptions made by different theories and the impact of theory on practice. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HH/PSYC 2020 6.00; HH/PSYC 2130 3.00; HH/PSYC 3140 3.00. Course credit exclusions: HH/PSYC 4060 6.00, GL/PSYC 4250 3.00."
  },
  {
    "code": " Skills and Techniques in Counselling and Psychotherapy",
    "name": "HH/PSYC 4062 3.00",
    "description": "Examines skills that are common to many modern psychotherapies. Theoretical papers and empirical studies evaluating various therapeutic techniques and clinical skills are considered. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HH/PSYC 2020 6.00; HH/PSYC 2130 3.00, HH/PSYC 3140 3.00; HH/PSYC 4061 3.00. Course credit exclusion: HH/PSYC 4060 6.00."
  },
  {
    "code": " Neuropsychology of Abnormal Behaviour",
    "name": "HH/PSYC 4080 6.00",
    "description": "An examination of the genetic, physiological and anatomical bases of several types of abnormal behaviour. The social, public policy and ethical implications of a neuropsychological view of abnormal behaviour are discussed. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HH/PSYC 2020 6.00; HH/PSYC 2240 3.00; HH/PSYC 3140 3.00; HH/NRSC 2100 3.00 or SC/NRSC 2100 3.00"
  },
  {
    "code": " Addiction Etiology and Treatment",
    "name": "HH/PSYC 4145 3.00",
    "description": "Introduces the psychology of addictive disorders, including their history, prevalence, theoretical underpinnings, and evidence-based treatment. Survey research on the biological, psychological, and social factors that contribute to the development and maintenance of addictive disorders. Covers contemporary issues in addiction psychology, with a specific focus on those issues that are relevant to Canadians. Prerequisites: HH/PSYC 1010 6.00 with a minimum grade of C, HH/PSYC 2010 3.00, HH/PSYC 2020 6.00 or HH/PSYC 2021 3.00 and HH/PSYC 2022 3.00, HH/PSYC 2030 3.00, HH/PSYC 2130 3.00; PSYC 3140 3.00 Open to: Honours students in Psychology who have earned at least 84 credits"
  },
  {
    "code": " Critical Psychology: Theory, Research, and Practice",
    "name": "HH/PSYC 4150 6.00",
    "description": "Examines the wide range of criticism mounted against contemporary mainstream psychology over the past 25 years and explores in depth several philosophically sophisticated alternative psychological approaches to the study of behaviour and experience. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HH/PSYC 2020 6.00."
  },
  {
    "code": " Critical Thinking in Psychology",
    "name": "HH/PSYC 4180 6.00",
    "description": "Critical thinking in this course refers to purposeful and self-regulated judgment applied to the processes of gathering, evaluating and integrating sometimes conflicting theories and evidence in Psychology to arrive at an informed opinion. Students will be taught to engage in critical thinking and to effectively communicate their conclusions to a general public audience. To promote flexibility in critical thinking about key aspects of Psychology, emphasis will be placed on covering topics in breadth. Prerequisites: HH/PSYC 1010 6.00 with a minimum grade of C, HH/PSYC 2020 6.00 or equivalent, HH/PSYC 2030 3.00 and have completed 84 credits. Course credit exclusion: HH/PSYC 4170 6.00. Open to: Honours students in Psychology. Note: Capstone course for non-thesis Honours program in Psychology."
  },
  {
    "code": " Seminar in Health Psychology",
    "name": "HH/PSYC 4190 3.00",
    "description": "This seminar will focus on a single health problem (e.g., HIV/AIDS, cardiovascular disease, cancer), using this as a unifying context to examine the interplay of biological, psychological and social determinants of health status and of health promoting and health damaging behaviours. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HH/PSYC 2020 6.00; HH/PSYC 3170 3.00."
  },
  {
    "code": " Neuroimaging of Cognition  fMRI methods",
    "name": "HH/PSYC 4215 3.00",
    "description": "This course offers fundamental knowledge on neuroimaging of cognition using fMRI, including practical aspects of experimental design and analytical approaches. The course provides the necessary theoretical perspectives of fMRI experiments and provides extensive hands-on experience in fMRI analysis. Integration: HH/PSYC 6226 3.00 Prerequisites: HH/PSYC 1010 6.00, HH/PSYC 2010 3.00, HH/PSYC 2030 3.00, HH/PSYC 3250 3.00 or HH/PSYC 2240 3.00; HH/PSYC 2020 6.00 or PSYC 2021 3.00 and PSYC 2022 3.00 Open to: student in the honours program with 84 earned credits or above"
  },
  {
    "code": " Theories of Human Nature",
    "name": "HH/PSYC 4220 6.00",
    "description": "A critical examination of theories of human nature with special emphasis on psychological theories, cultural and social theories, psychoanalysis, philosophical theories, racial theories and economic theories. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HH/PSYC 2020 6.00. Open to students after completion of 84 credits."
  },
  {
    "code": " Seminar in Sensation and Perception",
    "name": "HH/PSYC 4260 3.00",
    "description": "This seminar course gives advanced, detailed coverage of topics in sensation and perception. Specific topics vary according to the Instructor, and could include vision (e.g., shape perception, colour perception), hearing (e.g., auditory localization, speech perception), or vestibular perception (e.g., balance, the sense of movement). The course emphasizes reading and evaluating original scientific work, and readings include journal articles or research monographs. Special attention is paid to understanding the value and limitations of common experimental methods in perception research. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HH/PSYC 2020 6.00; HH/PSYC 2220 3.00."
  },
  {
    "code": " Seminar in Memory and Cognition",
    "name": "HH/PSYC 4270 3.00",
    "description": "An examination of a number of issues in memory and cognition. The course focuses on areas of current interest and may include topics such as pattern recognition, perception of art, memory retrieval, connectionist models, problem solving, thinking, concept formation, categorization and artificial intelligence. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HH/PSYC 2020 6.00; HH/PSYC 2260 3.00 or HH/PSYC 3265 3.00."
  },
  {
    "code": " Current Issues in Health Psychology",
    "name": "HH/PSYC 4370 3.00",
    "description": "Examines current theoretical and practical issues in clinical and hospital-based health psychology. Students present, critically evaluate, reflect upon, and discuss current evidence and theory related to disease development as well as preventive and therapeutic interventions for chronic diseases and conditions in which health-compromising and health-enhancing behaviours play a role. Instructional methods include case studies and experiential class activities. Integration: GS/PSYC 6455 3.00. Prerequisites: HH/PSYC 1010 6.00, with minimum grade of C; HH/PSYC 2021 3.00 or HH/PSYC 2020 6.00; HH/PSYC 2030 3.00; HH/PSYC 2240 3.0; HH/PSYC 3170 3.00; must be in a Specialized Honours program in Psychology and have completed at least 84 credits; excluding (EDUC) education courses."
  },
  {
    "code": " Atypical Development",
    "name": "HH/PSYC 4460 6.00",
    "description": "An examination of psychological problems and disorders of childhood and adolescence including an extensive exploration of their nature, causes, and treatment based on current research. Developmental risks and protective factors will be considered. Students are also required to complete a volunteer placement in childrens settings, such as schools and childhood agencies. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C; HH/PSYC 2030 3.00; one of HH/PSYC 2021 3.00, HH/PSYC 2020 6.00; HH/PSYC 2110 3.00. Course credit exclusion: GL/PSYC 3510 3.00."
  },
  {
    "code": " Individual Research Project",
    "name": "HH/PSYC 4900 3.00",
    "description": "Students arrange to complete an individual research project with a full-time faculty member in the Psychology Department, Faculty of Health. This course allows students to obtain first-hand research experience in a professors area of research expertise. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C, HH/PSYC 2010 3.00; one of HH/PSYC 2020 6.00 or HH/PSYC 2021 3.00 and HH/PSYC 2022 3.00. Open to students with 84 earned credits in the Honours or Specialized. Note: Students may complete one 6.00 credit or two 3.00 credit Individual Research Project courses in each academic year, to a maximum of 12.00 credits in total (HH/PSYC 3900 series and HH/PSYC 4900 series combined). After securing a supervisor, students should consult the Department of Psychology for an application."
  },
  {
    "code": " Individual Research Project",
    "name": "HH/PSYC 4901 3.00",
    "description": "Students arrange to complete an individual research project with a full-time faculty member in the Psychology Department, Faculty of Health. This course allows students to obtain first-hand research experience in a professors area of research expertise. Prerequisites: including HH/PSYC 1010 6.00, with a minimum grade of C, HH/PSYC 2010 3.00; one of HH/PSYC 2020 6.00 or HH/PSYC 2021 3.00 and HH/PSYC 2022 3.00. Open to: Students with 84 earned credits in the Honours or Specialized Honours Programs in Psychology. Note: Students may complete one 6.00 credit or two 3.00 credit Individual Research Project courses in each academic year, to a maximum of 12.00 credits in total (HH/PSYC 3900 series and HH/PSYC 4900 series combined). After securing a supervisor, students should consult the Department of Psychology for an application."
  },
  {
    "code": " Individual Research Project",
    "name": "HH/PSYC 4902 6.00",
    "description": "Students arrange to complete an individual research project with a full-time faculty member in the Psychology Department, Faculty of Health. This course allows students to obtain first-hand research experience in a professors area of research expertise. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C, HH/PSYC 2010 3.00; one of HH/PSYC 2020 6.00 or HH/PSYC 2021 3.00 and HH/PSYC 2022 3.00. Open to: Students with 84 earned credits in the Honours or Specialized Honours Programs in Psychology. Note: Students may complete one 6.00 credit or two 3.00 credit Individual Research Project courses in each academic year, to a maximum of 12.00 credits in total (HH/PSYC 3900 series and HH/PSYC 4900 series combined). After securing a supervisor, students should consult the Department of Psychology for an application."
  },
  {
    "code": " Individual Research Project",
    "name": "HH/PSYC 4903 6.00",
    "description": "Students arrange to complete an individual research project with a full-time faculty member in the Psychology Department, Faculty of Health. This course allows students to obtain first-hand research experience in a professors area of research expertise. Prerequisites: HH/PSYC 1010 6.00, with a minimum grade of C, HH/PSYC 2010 3.00; one of HH/PSYC 2020 6.00 or HH/PSYC 2021 3.00 and HH/PSYC 2022 3.00. Open to: Students with 84 earned credits in the Honours or Specialized Honours Programs in Psychology. Note: Students may complete one 6.00 credit or two 3.00 credit Individual Research Project courses in each academic year, to a maximum of 12.00 credits in total (HH/PSYC 3900 series and HH/PSYC 4900 series combined). After securing a supervisor, students should consult the Department of Psychology for an application."
  }
]