{"name":"David","studentID":"218144000","major":"Software Engineering","courses":[{"course":{"code":"LE/CIVL 2120 3.00","name":"Civil Engineering Materials","description":"Chemical, physical and mechanical properties of common civil engineering materials, such as Portland cement, Portland cement concrete, metals and alloys, wood, asphalt, asphalt concrete, masonry, and polymer composites; phenomenological basis for the properties of these materials; introduction to material characterization and quality control. Prerequisite: SC/CHEM 1100 4.00.","prerequisites":["SC/CHEM 1100 4.00"]},"courseCode":"LE/CIVL 2120 3.00","grade":"D","gradeVal":2,"credit":3.0},{"course":{"code":"LE/CIVL 2210 4.00","name":"Fluid Mechanics","description":"This course covers the basic properties of fluids and their measurement; fluid statics; kinematics of fluid flow; measurement of pressure; velocity and discharge; conservation of mass, momentum and energy; dimensional analysis. Bernoullis equation and its applications are also introduced. Prerequisites: SC/MATH 1014 3.00, SC/PHYS 1800 3.00.","prerequisites":["SC/MATH 1014 3.00","SC/PHYS 1800 3.00"]},"courseCode":"LE/CIVL 2210 4.00","grade":"B+","gradeVal":7,"credit":4.0},{"course":{"code":"LE/CIVL 2150 3.00","name":"Civil Engineering Graphics","description":"Introduction to computer-aided drawing with applications in civil engineering and related disciplines. Students will learn about the principles of engineering drawings, create typical drawings using Computer-aided Drawing (CAD) tools, and read and interpret civil and geomatics engineering drawings. Prerequisite: LE/ENG 1102 4.00.","prerequisites":["LE/ENG 1102 4.00"]},"courseCode":"LE/CIVL 2150 3.00","grade":"A","gradeVal":8,"credit":3.0},{"course":{"code":"LE/EECS 2311 3.00","name":"Software Development Project","description":"This course allows students to develop a significant piece of software utilizing all the skills they have acquired so far. This includes requirement elicitation, system specification, implementation, testing, deployment, and user documentation. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"); LE/EECS 1030 3.00 or LE/EECS 2030 3.00.","prerequisites":["LE/EECS 1030 3.00","LE/EECS 2030 3.00"]},"courseCode":"LE/EECS 2311 3.00","grade":"A","gradeVal":8,"credit":3.0}]}