{"name":"David","studentID":"218140000","major":"Software Engineering","courses":[{"course":{"code":"LE/CIVL 2160 3.00","name":"Geological Processes","description":"This course presents essential topics in physical geology and earth sciences, including: plate tectonics and the geological cycle; identification and physical properties of rocks, soil and minerals; igneous, metamorphic and sedimentary rock formation; weathering and soil formation; structural geology and geological mapping; relative age relationships; and, near-surface geological processes and resulting landforms. The course also briefly introduces the students to the topics of earthquakes, landslides and other natural hazards and develops links to the physical properties. Prerequisite: ESSE 1012 3.00.","prerequisites":[""]},"courseCode":"LE/CIVL 2160 3.00","grade":"D","gradeVal":2,"credit":3.0},{"course":{"code":"LE/CIVL 2240 3.00","name":"Introduction to Environmental Engineering","description":"Physical environment and how it is influenced by human activity; Mass and energy balance of environmental systems; environmental pollution and its causes; basic principles in chemistry and physics to explain the behaviour of pollutants in the environment (air, land and water); contaminant transport through air, water and solids; application of environmental engineering principles to water and wastewater treatment, water resources management, environmental impact assessment; environmental ethics; greenhouse effect; ozone depletion; acid precipitation; sustainable development and life cycle assessment; overview of environmental quality objectives, standards and guidelines. Prerequisites: LE/ESSE 1012 3.00, SC/CHEM 1100 4.00.","prerequisites":["LE/ESSE 1012 3.00","SC/CHEM 1100 4.00"]},"courseCode":"LE/CIVL 2240 3.00","grade":"B+","gradeVal":7,"credit":3.0},{"course":{"code":"LE/EECS 2011 3.00","name":"Fundamentals of Data Structures","description":"A study of fundamental data structures and their use in the efficient implementation of algorithms. Topics include abstract data types, lists, stacks, queues, trees and graphs. Prerequisites: cumulative GPA of 4.50 or better over all major EECS courses (without second digit \"5\"), LE/EECS 1030 3.00 or LE/EECS 2030 3.00, LE/EECS 1028 3.00 OR SC/MATH 1028 3.00 or LE/EECS 1019 3.00 or SC/MATH 1019 3.00. Previously offered as: LE/CSE 2011 3.00. The course discusses the fundamental data structures commonly used in the design of algorithms. Abstract operations on data structures are specified using pre and post conditions and/or system invariants. Trade-offs between a number of different implementations of each abstract data types (ADT) are analyzed. Each algorithm operating on data structures is proved correct using loop invariants or induction. Both formal and informal proofs are introduced though most of the reasoning is done informally. Data structures are coded and unit tested in an object-oriented language. Selecting the appropriate ADT and a suitable implementation depending on the application is covered. Prerequisites: EECS1019 or EECS1028, EECS1030 or 2030, MATHS1090 Date of submission: 2013-13-03","prerequisites":[""]},"courseCode":"LE/EECS 2011 3.00","grade":"B","gradeVal":6,"credit":3.0}]}